node {
  name: "global_step/Initializer/zeros"
  op: "Const"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@global_step"
      }
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_INT64
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT64
        tensor_shape {
        }
        int64_val: 0
      }
    }
  }
}
node {
  name: "global_step"
  op: "VariableV2"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@global_step"
      }
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_INT64
    }
  }
  attr {
    key: "shape"
    value {
      shape {
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: ""
    }
  }
}
node {
  name: "global_step/Assign"
  op: "Assign"
  input: "global_step"
  input: "global_step/Initializer/zeros"
  attr {
    key: "T"
    value {
      type: DT_INT64
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@global_step"
      }
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
  attr {
    key: "use_locking"
    value {
      b: true
    }
  }
  attr {
    key: "validate_shape"
    value {
      b: true
    }
  }
}
node {
  name: "global_step/read"
  op: "Identity"
  input: "global_step"
  attr {
    key: "T"
    value {
      type: DT_INT64
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@global_step"
      }
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
}
node {
  name: "global_step/IsVariableInitialized"
  op: "IsVariableInitialized"
  input: "global_step"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@global_step"
      }
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_INT64
    }
  }
}
node {
  name: "global_step/cond/Switch"
  op: "Switch"
  input: "global_step/IsVariableInitialized"
  input: "global_step/IsVariableInitialized"
  attr {
    key: "T"
    value {
      type: DT_BOOL
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
        shape {
        }
      }
    }
  }
}
node {
  name: "global_step/cond/switch_t"
  op: "Identity"
  input: "global_step/cond/Switch:1"
  attr {
    key: "T"
    value {
      type: DT_BOOL
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
}
node {
  name: "global_step/cond/switch_f"
  op: "Identity"
  input: "global_step/cond/Switch"
  attr {
    key: "T"
    value {
      type: DT_BOOL
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
}
node {
  name: "global_step/cond/pred_id"
  op: "Identity"
  input: "global_step/IsVariableInitialized"
  attr {
    key: "T"
    value {
      type: DT_BOOL
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
}
node {
  name: "global_step/cond/read"
  op: "Identity"
  input: "global_step/cond/read/Switch:1"
  attr {
    key: "T"
    value {
      type: DT_INT64
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
}
node {
  name: "global_step/cond/read/Switch"
  op: "RefSwitch"
  input: "global_step"
  input: "global_step/cond/pred_id"
  attr {
    key: "T"
    value {
      type: DT_INT64
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@global_step"
      }
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
        shape {
        }
      }
    }
  }
}
node {
  name: "global_step/cond/Switch_1"
  op: "Switch"
  input: "global_step/Initializer/zeros"
  input: "global_step/cond/pred_id"
  attr {
    key: "T"
    value {
      type: DT_INT64
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@global_step"
      }
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
        shape {
        }
      }
    }
  }
}
node {
  name: "global_step/cond/Merge"
  op: "Merge"
  input: "global_step/cond/Switch_1"
  input: "global_step/cond/read"
  attr {
    key: "N"
    value {
      i: 2
    }
  }
  attr {
    key: "T"
    value {
      type: DT_INT64
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
        shape {
        }
      }
    }
  }
}
node {
  name: "global_step/add/y"
  op: "Const"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_INT64
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT64
        tensor_shape {
        }
        int64_val: 0
      }
    }
  }
}
node {
  name: "global_step/add"
  op: "Add"
  input: "global_step/cond/Merge"
  input: "global_step/add/y"
  attr {
    key: "T"
    value {
      type: DT_INT64
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
}
node {
  name: "tensors/normalize_tensors/component_0"
  op: "Const"
  device: "/device:CPU:0"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 2861
          }
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_STRING
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_STRING
        tensor_shape {
          dim {
            size: 2861
          }
        }
        string_val: "./topology/tfrecords/train_data_per_200/1001.tfrecords"
        string_val: "./topology/tfrecords/train_data_per_200/1002.tfrecords"
        string_val: "./topology/tfrecords/train_data_per_200/1003.tfrecords"
        string_val: "./topology/tfrecords/train_data_per_200/1005.tfrecords"
        string_val: "./topology/tfrecords/train_data_per_200/1006.tfrecords"
        string_val: "./topology/tfrecords/train_data_per_200/1007.tfrecords"
        string_val: "./topology/tfrecords/train_data_per_200/1008.tfrecords"
        string_val: "./topology/tfrecords/train_data_per_200/1009.tfrecords"
        string_val: "./topology/tfrecords/train_data_per_200/100.tfrecords"
        string_val: "./topology/tfrecords/train_data_per_200/1010.tfrecords"
        string_val: "./topology/tfrecords/train_data_per_200/1011.tfrecords"
        string_val: "./topology/tfrecords/train_data_per_200/1013.tfrecords"
        string_val: "./topology/tfrecords/train_data_per_200/1014.tfrecords"
        string_val: "./topology/tfrecords/train_data_per_200/1016.tfrecords"
        string_val: "./topology/tfrecords/train_data_per_200/1017.tfrecords"
        string_val: "./topology/tfrecords/train_data_per_200/1018.tfrecords"
        string_val: "./topology/tfrecords/train_data_per_200/1019.tfrecords"
        string_val: "./topology/tfrecords/train_data_per_200/101.tfrecords"
        string_val: "./topology/tfrecords/train_data_per_200/1021.tfrecords"
        string_val: "./topology/tfrecords/train_data_per_200/1022.tfrecords"
        string_val: "./topology/tfrecords/train_data_per_200/1023.tfrecords"
        string_val: "./topology/tfrecords/train_data_per_200/1024.tfrecords"
        string_val: "./topology/tfrecords/train_data_per_200/1026.tfrecords"
        string_val: "./topology/tfrecords/train_data_per_200/1027.tfrecords"
        string_val: "./topology/tfrecords/train_data_per_200/1028.tfrecords"
        string_val: "./topology/tfrecords/train_data_per_200/1029.tfrecords"
        string_val: "./topology/tfrecords/train_data_per_200/102.tfrecords"
        string_val: "./topology/tfrecords/train_data_per_200/1030.tfrecords"
        string_val: "./topology/tfrecords/train_data_per_200/1031.tfrecords"
        string_val: "./topology/tfrecords/train_data_per_200/1032.tfrecords"
        string_val: "./topology/tfrecords/train_data_per_200/1033.tfrecords"
        string_val: "./topology/tfrecords/train_data_per_200/1034.tfrecords"
        string_val: "./topology/tfrecords/train_data_per_200/1035.tfrecords"
        string_val: "./topology/tfrecords/train_data_per_200/1036.tfrecords"
        string_val: "./topology/tfrecords/train_data_per_200/1038.tfrecords"
        string_val: "./topology/tfrecords/train_data_per_200/1039.tfrecords"
        string_val: "./topology/tfrecords/train_data_per_200/1040.tfrecords"
        string_val: "./topology/tfrecords/train_data_per_200/1041.tfrecords"
        string_val: "./topology/tfrecords/train_data_per_200/1042.tfrecords"
        string_val: "./topology/tfrecords/train_data_per_200/1043.tfrecords"
        string_val: "./topology/tfrecords/train_data_per_200/1045.tfrecords"
        string_val: "./topology/tfrecords/train_data_per_200/1048.tfrecords"
        string_val: "./topology/tfrecords/train_data_per_200/1049.tfrecords"
        string_val: "./topology/tfrecords/train_data_per_200/104.tfrecords"
        string_val: "./topology/tfrecords/train_data_per_200/1051.tfrecords"
        string_val: "./topology/tfrecords/train_data_per_200/1052.tfrecords"
        string_val: "./topology/tfrecords/train_data_per_200/1053.tfrecords"
        string_val: "./topology/tfrecords/train_data_per_200/1054.tfrecords"
        string_val: "./topology/tfrecords/train_data_per_200/1055.tfrecords"
        string_val: "./topology/tfrecords/train_data_per_200/1056.tfrecords"
        string_val: "./topology/tfrecords/train_data_per_200/1058.tfrecords"
        string_val: "./topology/tfrecords/train_data_per_200/1059.tfrecords"
        string_val: "./topology/tfrecords/train_data_per_200/105.tfrecords"
        string_val: "./topology/tfrecords/train_data_per_200/1060.tfrecords"
        string_val: "./topology/tfrecords/train_data_per_200/1061.tfrecords"
        string_val: "./topology/tfrecords/train_data_per_200/1062.tfrecords"
        string_val: "./topology/tfrecords/train_data_per_200/1063.tfrecords"
        string_val: "./topology/tfrecords/train_data_per_200/1064.tfrecords"
        string_val: "./topology/tfrecords/train_data_per_200/1066.tfrecords"
        string_val: "./topology/tfrecords/train_data_per_200/1067.tfrecords"
        string_val: "./topology/tfrecords/train_data_per_200/1068.tfrecords"
        string_val: "./topology/tfrecords/train_data_per_200/1069.tfrecords"
        string_val: "./topology/tfrecords/train_data_per_200/106.tfrecords"
        string_val: "./topology/tfrecords/train_data_per_200/1070.tfrecords"
        string_val: "./topology/tfrecords/train_data_per_200/1072.tfrecords"
        string_val: "./topology/tfrecords/train_data_per_200/1074.tfrecords"
        string_val: "./topology/tfrecords/train_data_per_200/1075.tfrecords"
        string_val: "./topology/tfrecords/train_data_per_200/1076.tfrecords"
        string_val: "./topology/tfrecords/train_data_per_200/1077.tfrecords"
        string_val: "./topology/tfrecords/train_data_per_200/1078.tfrecords"
        string_val: "./topology/tfrecords/train_data_per_200/1079.tfrecords"
        string_val: "./topology/tfrecords/train_data_per_200/107.tfrecords"
        string_val: "./topology/tfrecords/train_data_per_200/1080.tfrecords"
        string_val: "./topology/tfrecords/train_data_per_200/1081.tfrecords"
        string_val: "./topology/tfrecords/train_data_per_200/1083.tfrecords"
        string_val: "./topology/tfrecords/train_data_per_200/1085.tfrecords"
        string_val: "./topology/tfrecords/train_data_per_200/1086.tfrecords"
        string_val: "./topology/tfrecords/train_data_per_200/1087.tfrecords"
        string_val: "./topology/tfrecords/train_data_per_200/1089.tfrecords"
        string_val: "./topology/tfrecords/train_data_per_200/108.tfrecords"
        string_val: "./topology/tfrecords/train_data_per_200/1090.tfrecords"
        string_val: "./topology/tfrecords/train_data_per_200/1091.tfrecords"
        string_val: "./topology/tfrecords/train_data_per_200/1092.tfrecords"
        string_val: "./topology/tfrecords/train_data_per_200/1093.tfrecords"
        string_val: "./topology/tfrecords/train_data_per_200/1095.tfrecords"
        string_val: "./topology/tfrecords/train_data_per_200/1096.tfrecords"
        string_val: "./topology/tfrecords/train_data_per_200/1097.tfrecords"
        string_val: "./topology/tfrecords/train_data_per_200/1099.tfrecords"
        string_val: "./topology/tfrecords/train_data_per_200/109.tfrecords"
        string_val: "./topology/tfrecords/train_data_per_200/10.tfrecords"
        string_val: "./topology/tfrecords/train_data_per_200/1100.tfrecords"
        string_val: "./topology/tfrecords/train_data_per_200/1102.tfrecords"
        string_val: "./topology/tfrecords/train_data_per_200/1104.tfrecords"
        string_val: "./topology/tfrecords/train_data_per_200/1106.tfrecords"
        string_val: "./topology/tfrecords/train_data_per_200/1107.tfrecords"
        string_val: "./topology/tfrecords/train_data_per_200/1108.tfrecords"
        string_val: "./topology/tfrecords/train_data_per_200/110.tfrecords"
        string_val: "./topology/tfrecords/train_data_per_200/1111.tfrecords"
        string_val: "./topology/tfrecords/train_data_per_200/1112.tfrecords"
        string_val: "./topology/tfrecords/train_data_per_200/1113.tfrecords"
        string_val: "./topology/tfrecords/train_data_per_200/1114.tfrecords"
        string_val: "./topology/tfrecords/train_data_per_200/1115.tfrecords"
        string_val: "./topology/tfrecords/train_data_per_200/1116.tfrecords"
        string_val: "./topology/tfrecords/train_data_per_200/1117.tfrecords"
        string_val: "./topology/tfrecords/train_data_per_200/1118.tfrecords"
        string_val: "./topology/tfrecords/train_data_per_200/1119.tfrecords"
        string_val: "./topology/tfrecords/train_data_per_200/111.tfrecords"
        string_val: "./topology/tfrecords/train_data_per_200/1120.tfrecords"
        string_val: "./topology/tfrecords/train_data_per_200/1122.tfrecords"
        string_val: "./topology/tfrecords/train_data_per_200/1123.tfrecords"
        string_val: "./topology/tfrecords/train_data_per_200/1124.tfrecords"
        string_val: "./topology/tfrecords/train_data_per_200/1126.tfrecords"
        string_val: "./topology/tfrecords/train_data_per_200/1127.tfrecords"
        string_val: "./topology/tfrecords/train_data_per_200/1128.tfrecords"
        string_val: "./topology/tfrecords/train_data_per_200/112.tfrecords"
        string_val: "./topology/tfrecords/train_data_per_200/1132.tfrecords"
        string_val: "./topology/tfrecords/train_data_per_200/1133.tfrecords"
        string_val: "./topology/tfrecords/train_data_per_200/1134.tfrecords"
        string_val: "./topology/tfrecords/train_data_per_200/1135.tfrecords"
        string_val: "./topology/tfrecords/train_data_per_200/1136.tfrecords"
        string_val: "./topology/tfrecords/train_data_per_200/1137.tfrecords"
        string_val: "./topology/tfrecords/train_data_per_200/1138.tfrecords"
        string_val: "./topology/tfrecords/train_data_per_200/1139.tfrecords"
        string_val: "./topology/tfrecords/train_data_per_200/1140.tfrecords"
        string_val: "./topology/tfrecords/train_data_per_200/1142.tfrecords"
        string_val: "./topology/tfrecords/train_data_per_200/1144.tfrecords"
        string_val: "./topology/tfrecords/train_data_per_200/1145.tfrecords"
        string_val: "./topology/tfrecords/train_data_per_200/1146.tfrecords"
        string_val: "./topology/tfrecords/train_data_per_200/1147.tfrecords"
        string_val: "./topology/tfrecords/train_data_per_200/1148.tfrecords"
        string_val: "./topology/tfrecords/train_data_per_200/1149.tfrecords"
        string_val: "./topology/tfrecords/train_data_per_200/114.tfrecords"
        string_val: "./topology/tfrecords/train_data_per_200/1151.tfrecords"
        string_val: "./topology/tfrecords/train_data_per_200/1152.tfrecords"
        string_val: "./topology/tfrecords/train_data_per_200/1153.tfrecords"
        string_val: "./topology/tfrecords/train_data_per_200/1155.tfrecords"
        string_val: "./topology/tfrecords/train_data_per_200/1157.tfrecords"
        string_val: "./topology/tfrecords/train_data_per_200/1158.tfrecords"
        string_val: "./topology/tfrecords/train_data_per_200/1159.tfrecords"
        string_val: "./topology/tfrecords/train_data_per_200/115.tfrecords"
        string_val: "./topology/tfrecords/train_data_per_200/1160.tfrecords"
        string_val: "./topology/tfrecords/train_data_per_200/1161.tfrecords"
        string_val: "./topology/tfrecords/train_data_per_200/1162.tfrecords"
        string_val: "./topology/tfrecords/train_data_per_200/1165.tfrecords"
        string_val: "./topology/tfrecords/train_data_per_200/1166.tfrecords"
        string_val: "./topology/tfrecords/train_data_per_200/1167.tfrecords"
        string_val: "./topology/tfrecords/train_data_per_200/1169.tfrecords"
        string_val: "./topology/tfrecords/train_data_per_200/116.tfrecords"
        string_val: "./topology/tfrecords/train_data_per_200/1170.tfrecords"
        string_val: "./topology/tfrecords/train_data_per_200/1171.tfrecords"
        string_val: "./topology/tfrecords/train_data_per_200/1172.tfrecords"
        string_val: "./topology/tfrecords/train_data_per_200/1173.tfrecords"
        string_val: "./topology/tfrecords/train_data_per_200/1176.tfrecords"
        string_val: "./topology/tfrecords/train_data_per_200/1178.tfrecords"
        string_val: "./topology/tfrecords/train_data_per_200/1179.tfrecords"
        string_val: "./topology/tfrecords/train_data_per_200/117.tfrecords"
        string_val: "./topology/tfrecords/train_data_per_200/1180.tfrecords"
        string_val: "./topology/tfrecords/train_data_per_200/1181.tfrecords"
        string_val: "./topology/tfrecords/train_data_per_200/1182.tfrecords"
        string_val: "./topology/tfrecords/train_data_per_200/1184.tfrecords"
        string_val: "./topology/tfrecords/train_data_per_200/1185.tfrecords"
        string_val: "./topology/tfrecords/train_data_per_200/1186.tfrecords"
        string_val: "./topology/tfrecords/train_data_per_200/1187.tfrecords"
        string_val: "./topology/tfrecords/train_data_per_200/1188.tfrecords"
        string_val: "./topology/tfrecords/train_data_per_200/1189.tfrecords"
        string_val: "./topology/tfrecords/train_data_per_200/1190.tfrecords"
        string_val: "./topology/tfrecords/train_data_per_200/1191.tfrecords"
        string_val: "./topology/tfrecords/train_data_per_200/1192.tfrecords"
        string_val: "./topology/tfrecords/train_data_per_200/1193.tfrecords"
        string_val: "./topology/tfrecords/train_data_per_200/1194.tfrecords"
        string_val: "./topology/tfrecords/train_data_per_200/1195.tfrecords"
        string_val: "./topology/tfrecords/train_data_per_200/1196.tfrecords"
        string_val: "./topology/tfrecords/train_data_per_200/1197.tfrecords"
        string_val: "./topology/tfrecords/train_data_per_200/1198.tfrecords"
        string_val: "./topology/tfrecords/train_data_per_200/1199.tfrecords"
        string_val: "./topology/tfrecords/train_data_per_200/119.tfrecords"
        string_val: "./topology/tfrecords/train_data_per_200/11.tfrecords"
        string_val: "./topology/tfrecords/train_data_per_200/1200.tfrecords"
        string_val: "./topology/tfrecords/train_data_per_200/1201.tfrecords"
        string_val: "./topology/tfrecords/train_data_per_200/1202.tfrecords"
        string_val: "./topology/tfrecords/train_data_per_200/1203.tfrecords"
        string_val: "./topology/tfrecords/train_data_per_200/1204.tfrecords"
        string_val: "./topology/tfrecords/train_data_per_200/1206.tfrecords"
        string_val: "./topology/tfrecords/train_data_per_200/1207.tfrecords"
        string_val: "./topology/tfrecords/train_data_per_200/1208.tfrecords"
        string_val: "./topology/tfrecords/train_data_per_200/1209.tfrecords"
        string_val: "./topology/tfrecords/train_data_per_200/120.tfrecords"
        string_val: "./topology/tfrecords/train_data_per_200/1210.tfrecords"
        string_val: "./topology/tfrecords/train_data_per_200/1211.tfrecords"
        string_val: "./topology/tfrecords/train_data_per_200/1212.tfrecords"
        string_val: "./topology/tfrecords/train_data_per_200/1213.tfrecords"
        string_val: "./topology/tfrecords/train_data_per_200/1214.tfrecords"
        string_val: "./topology/tfrecords/train_data_per_200/1215.tfrecords"
        string_val: "./topology/tfrecords/train_data_per_200/1216.tfrecords"
        string_val: "./topology/tfrecords/train_data_per_200/1217.tfrecords"
        string_val: "./topology/tfrecords/train_data_per_200/121.tfrecords"
        string_val: "./topology/tfrecords/train_data_per_200/1220.tfrecords"
        string_val: "./topology/tfrecords/train_data_per_200/1221.tfrecords"
        string_val: "./topology/tfrecords/train_data_per_200/1222.tfrecords"
        string_val: "./topology/tfrecords/train_data_per_200/1223.tfrecords"
        string_val: "./topology/tfrecords/train_data_per_200/1224.tfrecords"
        string_val: "./topology/tfrecords/train_data_per_200/1225.tfrecords"
        string_val: "./topology/tfrecords/train_data_per_200/1226.tfrecords"
        string_val: "./topology/tfrecords/train_data_per_200/1227.tfrecords"
        string_val: "./topology/tfrecords/train_data_per_200/1228.tfrecords"
        string_val: "./topology/tfrecords/train_data_per_200/1229.tfrecords"
        string_val: "./topology/tfrecords/train_data_per_200/122.tfrecords"
        string_val: "./topology/tfrecords/train_data_per_200/1230.tfrecords"
        string_val: "./topology/tfrecords/train_data_per_200/1232.tfrecords"
        string_val: "./topology/tfrecords/train_data_per_200/1233.tfrecords"
        string_val: "./topology/tfrecords/train_data_per_200/1235.tfrecords"
        string_val: "./topology/tfrecords/train_data_per_200/1237.tfrecords"
        string_val: "./topology/tfrecords/train_data_per_200/1238.tfrecords"
        string_val: "./topology/tfrecords/train_data_per_200/1239.tfrecords"
        string_val: "./topology/tfrecords/train_data_per_200/123.tfrecords"
        string_val: "./topology/tfrecords/train_data_per_200/1241.tfrecords"
        string_val: "./topology/tfrecords/train_data_per_200/1242.tfrecords"
        string_val: "./topology/tfrecords/train_data_per_200/1243.tfrecords"
        string_val: "./topology/tfrecords/train_data_per_200/1244.tfrecords"
        string_val: "./topology/tfrecords/train_data_per_200/1245.tfrecords"
        string_val: "./topology/tfrecords/train_data_per_200/1246.tfrecords"
        string_val: "./topology/tfrecords/train_data_per_200/1247.tfrecords"
        string_val: "./topology/tfrecords/train_data_per_200/1248.tfrecords"
        string_val: "./topology/tfrecords/train_data_per_200/1249.tfrecords"
        string_val: "./topology/tfrecords/train_data_per_200/124.tfrecords"
        string_val: "./topology/tfrecords/train_data_per_200/1250.tfrecords"
        string_val: "./topology/tfrecords/train_data_per_200/1251.tfrecords"
        string_val: "./topology/tfrecords/train_data_per_200/1252.tfrecords"
        string_val: "./topology/tfrecords/train_data_per_200/1253.tfrecords"
        string_val: "./topology/tfrecords/train_data_per_200/1254.tfrecords"
        string_val: "./topology/tfrecords/train_data_per_200/1255.tfrecords"
        string_val: "./topology/tfrecords/train_data_per_200/1256.tfrecords"
        string_val: "./topology/tfrecords/train_data_per_200/1257.tfrecords"
        string_val: "./topology/tfrecords/train_data_per_200/1258.tfrecords"
        string_val: "./topology/tfrecords/train_data_per_200/1259.tfrecords"
        string_val: "./topology/tfrecords/train_data_per_200/125.tfrecords"
        string_val: "./topology/tfrecords/train_data_per_200/1260.tfrecords"
        string_val: "./topology/tfrecords/train_data_per_200/1265.tfrecords"
        string_val: "./topology/tfrecords/train_data_per_200/1266.tfrecords"
        string_val: "./topology/tfrecords/train_data_per_200/1267.tfrecords"
        string_val: "./topology/tfrecords/train_data_per_200/1268.tfrecords"
        string_val: "./topology/tfrecords/train_data_per_200/126.tfrecords"
        string_val: "./topology/tfrecords/train_data_per_200/1271.tfrecords"
        string_val: "./topology/tfrecords/train_data_per_200/1272.tfrecords"
        string_val: "./topology/tfrecords/train_data_per_200/1274.tfrecords"
        string_val: "./topology/tfrecords/train_data_per_200/1275.tfrecords"
        string_val: "./topology/tfrecords/train_data_per_200/1276.tfrecords"
        string_val: "./topology/tfrecords/train_data_per_200/1277.tfrecords"
        string_val: "./topology/tfrecords/train_data_per_200/1278.tfrecords"
        string_val: "./topology/tfrecords/train_data_per_200/1279.tfrecords"
        string_val: "./topology/tfrecords/train_data_per_200/1281.tfrecords"
        string_val: "./topology/tfrecords/train_data_per_200/1282.tfrecords"
        string_val: "./topology/tfrecords/train_data_per_200/1284.tfrecords"
        string_val: "./topology/tfrecords/train_data_per_200/1285.tfrecords"
        string_val: "./topology/tfrecords/train_data_per_200/1286.tfrecords"
        string_val: "./topology/tfrecords/train_data_per_200/1288.tfrecords"
        string_val: "./topology/tfrecords/train_data_per_200/1289.tfrecords"
        string_val: "./topology/tfrecords/train_data_per_200/128.tfrecords"
        string_val: "./topology/tfrecords/train_data_per_200/1290.tfrecords"
        string_val: "./topology/tfrecords/train_data_per_200/1291.tfrecords"
        string_val: "./topology/tfrecords/train_data_per_200/1292.tfrecords"
        string_val: "./topology/tfrecords/train_data_per_200/1294.tfrecords"
        string_val: "./topology/tfrecords/train_data_per_200/1295.tfrecords"
        string_val: "./topology/tfrecords/train_data_per_200/1296.tfrecords"
        string_val: "./topology/tfrecords/train_data_per_200/1297.tfrecords"
        string_val: "./topology/tfrecords/train_data_per_200/1298.tfrecords"
        string_val: "./topology/tfrecords/train_data_per_200/1299.tfrecords"
        string_val: "./topology/tfrecords/train_data_per_200/129.tfrecords"
        string_val: "./topology/tfrecords/train_data_per_200/12.tfrecords"
        string_val: "./topology/tfrecords/train_data_per_200/1300.tfrecords"
        string_val: "./topology/tfrecords/train_data_per_200/1301.tfrecords"
        string_val: "./topology/tfrecords/train_data_per_200/1302.tfrecords"
        string_val: "./topology/tfrecords/train_data_per_200/1303.tfrecords"
        string_val: "./topology/tfrecords/train_data_per_200/1304.tfrecords"
        string_val: "./topology/tfrecords/train_data_per_200/1305.tfrecords"
        string_val: "./topology/tfrecords/train_data_per_200/1307.tfrecords"
        string_val: "./topology/tfrecords/train_data_per_200/130.tfrecords"
        string_val: "./topology/tfrecords/train_data_per_200/1311.tfrecords"
        string_val: "./topology/tfrecords/train_data_per_200/1312.tfrecords"
        string_val: "./topology/tfrecords/train_data_per_200/1313.tfrecords"
        string_val: "./topology/tfrecords/train_data_per_200/1314.tfrecords"
        string_val: "./topology/tfrecords/train_data_per_200/1315.tfrecords"
        string_val: "./topology/tfrecords/train_data_per_200/1316.tfrecords"
        string_val: "./topology/tfrecords/train_data_per_200/1317.tfrecords"
        string_val: "./topology/tfrecords/train_data_per_200/1318.tfrecords"
        string_val: "./topology/tfrecords/train_data_per_200/1321.tfrecords"
        string_val: "./topology/tfrecords/train_data_per_200/1322.tfrecords"
        string_val: "./topology/tfrecords/train_data_per_200/1323.tfrecords"
        string_val: "./topology/tfrecords/train_data_per_200/1325.tfrecords"
        string_val: "./topology/tfrecords/train_data_per_200/1327.tfrecords"
        string_val: "./topology/tfrecords/train_data_per_200/1328.tfrecords"
        string_val: "./topology/tfrecords/train_data_per_200/1329.tfrecords"
        string_val: "./topology/tfrecords/train_data_per_200/132.tfrecords"
        string_val: "./topology/tfrecords/train_data_per_200/1330.tfrecords"
        string_val: "./topology/tfrecords/train_data_per_200/1331.tfrecords"
        string_val: "./topology/tfrecords/train_data_per_200/1333.tfrecords"
        string_val: "./topology/tfrecords/train_data_per_200/1334.tfrecords"
        string_val: "./topology/tfrecords/train_data_per_200/1335.tfrecords"
        string_val: "./topology/tfrecords/train_data_per_200/1336.tfrecords"
        string_val: "./topology/tfrecords/train_data_per_200/1337.tfrecords"
        string_val: "./topology/tfrecords/train_data_per_200/1338.tfrecords"
        string_val: "./topology/tfrecords/train_data_per_200/1339.tfrecords"
        string_val: "./topology/tfrecords/train_data_per_200/133.tfrecords"
        string_val: "./topology/tfrecords/train_data_per_200/1340.tfrecords"
        string_val: "./topology/tfrecords/train_data_per_200/1341.tfrecords"
        string_val: "./topology/tfrecords/train_data_per_200/1342.tfrecords"
        string_val: "./topology/tfrecords/train_data_per_200/1343.tfrecords"
        string_val: "./topology/tfrecords/train_data_per_200/1344.tfrecords"
        string_val: "./topology/tfrecords/train_data_per_200/1345.tfrecords"
        string_val: "./topology/tfrecords/train_data_per_200/1346.tfrecords"
        string_val: "./topology/tfrecords/train_data_per_200/1347.tfrecords"
        string_val: "./topology/tfrecords/train_data_per_200/1349.tfrecords"
        string_val: "./topology/tfrecords/train_data_per_200/134.tfrecords"
        string_val: "./topology/tfrecords/train_data_per_200/1350.tfrecords"
        string_val: "./topology/tfrecords/train_data_per_200/1355.tfrecords"
        string_val: "./topology/tfrecords/train_data_per_200/1356.tfrecords"
        string_val: "./topology/tfrecords/train_data_per_200/1357.tfrecords"
        string_val: "./topology/tfrecords/train_data_per_200/1358.tfrecords"
        string_val: "./topology/tfrecords/train_data_per_200/1359.tfrecords"
        string_val: "./topology/tfrecords/train_data_per_200/135.tfrecords"
        string_val: "./topology/tfrecords/train_data_per_200/1361.tfrecords"
        string_val: "./topology/tfrecords/train_data_per_200/1362.tfrecords"
        string_val: "./topology/tfrecords/train_data_per_200/1363.tfrecords"
        string_val: "./topology/tfrecords/train_data_per_200/1364.tfrecords"
        string_val: "./topology/tfrecords/train_data_per_200/1365.tfrecords"
        string_val: "./topology/tfrecords/train_data_per_200/1366.tfrecords"
        string_val: "./topology/tfrecords/train_data_per_200/1368.tfrecords"
        string_val: "./topology/tfrecords/train_data_per_200/1369.tfrecords"
        string_val: "./topology/tfrecords/train_data_per_200/136.tfrecords"
        string_val: "./topology/tfrecords/train_data_per_200/1371.tfrecords"
        string_val: "./topology/tfrecords/train_data_per_200/1373.tfrecords"
        string_val: "./topology/tfrecords/train_data_per_200/1374.tfrecords"
        string_val: "./topology/tfrecords/train_data_per_200/1375.tfrecords"
        string_val: "./topology/tfrecords/train_data_per_200/1376.tfrecords"
        string_val: "./topology/tfrecords/train_data_per_200/1377.tfrecords"
        string_val: "./topology/tfrecords/train_data_per_200/1378.tfrecords"
        string_val: "./topology/tfrecords/train_data_per_200/137.tfrecords"
        string_val: "./topology/tfrecords/train_data_per_200/1380.tfrecords"
        string_val: "./topology/tfrecords/train_data_per_200/1381.tfrecords"
        string_val: "./topology/tfrecords/train_data_per_200/1382.tfrecords"
        string_val: "./topology/tfrecords/train_data_per_200/1385.tfrecords"
        string_val: "./topology/tfrecords/train_data_per_200/1386.tfrecords"
        string_val: "./topology/tfrecords/train_data_per_200/1389.tfrecords"
        string_val: "./topology/tfrecords/train_data_per_200/138.tfrecords"
        string_val: "./topology/tfrecords/train_data_per_200/1390.tfrecords"
        string_val: "./topology/tfrecords/train_data_per_200/1391.tfrecords"
        string_val: "./topology/tfrecords/train_data_per_200/1392.tfrecords"
        string_val: "./topology/tfrecords/train_data_per_200/1393.tfrecords"
        string_val: "./topology/tfrecords/train_data_per_200/1395.tfrecords"
        string_val: "./topology/tfrecords/train_data_per_200/1396.tfrecords"
        string_val: "./topology/tfrecords/train_data_per_200/1397.tfrecords"
        string_val: "./topology/tfrecords/train_data_per_200/1398.tfrecords"
        string_val: "./topology/tfrecords/train_data_per_200/1399.tfrecords"
        string_val: "./topology/tfrecords/train_data_per_200/139.tfrecords"
        string_val: "./topology/tfrecords/train_data_per_200/1400.tfrecords"
        string_val: "./topology/tfrecords/train_data_per_200/1402.tfrecords"
        string_val: "./topology/tfrecords/train_data_per_200/1403.tfrecords"
        string_val: "./topology/tfrecords/train_data_per_200/1405.tfrecords"
        string_val: "./topology/tfrecords/train_data_per_200/1406.tfrecords"
        string_val: "./topology/tfrecords/train_data_per_200/1407.tfrecords"
        string_val: "./topology/tfrecords/train_data_per_200/1408.tfrecords"
        string_val: "./topology/tfrecords/train_data_per_200/1409.tfrecords"
        string_val: "./topology/tfrecords/train_data_per_200/140.tfrecords"
        string_val: "./topology/tfrecords/train_data_per_200/1410.tfrecords"
        string_val: "./topology/tfrecords/train_data_per_200/1411.tfrecords"
        string_val: "./topology/tfrecords/train_data_per_200/1412.tfrecords"
        string_val: "./topology/tfrecords/train_data_per_200/1413.tfrecords"
        string_val: "./topology/tfrecords/train_data_per_200/1414.tfrecords"
        string_val: "./topology/tfrecords/train_data_per_200/1415.tfrecords"
        string_val: "./topology/tfrecords/train_data_per_200/1416.tfrecords"
        string_val: "./topology/tfrecords/train_data_per_200/1417.tfrecords"
        string_val: "./topology/tfrecords/train_data_per_200/1418.tfrecords"
        string_val: "./topology/tfrecords/train_data_per_200/1419.tfrecords"
        string_val: "./topology/tfrecords/train_data_per_200/141.tfrecords"
        string_val: "./topology/tfrecords/train_data_per_200/1421.tfrecords"
        string_val: "./topology/tfrecords/train_data_per_200/1422.tfrecords"
        string_val: "./topology/tfrecords/train_data_per_200/1423.tfrecords"
        string_val: "./topology/tfrecords/train_data_per_200/1424.tfrecords"
        string_val: "./topology/tfrecords/train_data_per_200/1425.tfrecords"
        string_val: "./topology/tfrecords/train_data_per_200/1427.tfrecords"
        string_val: "./topology/tfrecords/train_data_per_200/1428.tfrecords"
        string_val: "./topology/tfrecords/train_data_per_200/1429.tfrecords"
        string_val: "./topology/tfrecords/train_data_per_200/142.tfrecords"
        string_val: "./topology/tfrecords/train_data_per_200/1430.tfrecords"
        string_val: "./topology/tfrecords/train_data_per_200/1431.tfrecords"
        string_val: "./topology/tfrecords/train_data_per_200/1432.tfrecords"
        string_val: "./topology/tfrecords/train_data_per_200/1433.tfrecords"
        string_val: "./topology/tfrecords/train_data_per_200/1434.tfrecords"
        string_val: "./topology/tfrecords/train_data_per_200/1436.tfrecords"
        string_val: "./topology/tfrecords/train_data_per_200/1437.tfrecords"
        string_val: "./topology/tfrecords/train_data_per_200/1438.tfrecords"
        string_val: "./topology/tfrecords/train_data_per_200/1439.tfrecords"
        string_val: "./topology/tfrecords/train_data_per_200/143.tfrecords"
        string_val: "./topology/tfrecords/train_data_per_200/1441.tfrecords"
        string_val: "./topology/tfrecords/train_data_per_200/1442.tfrecords"
        string_val: "./topology/tfrecords/train_data_per_200/1443.tfrecords"
        string_val: "./topology/tfrecords/train_data_per_200/1444.tfrecords"
        string_val: "./topology/tfrecords/train_data_per_200/1445.tfrecords"
        string_val: "./topology/tfrecords/train_data_per_200/1446.tfrecords"
        string_val: "./topology/tfrecords/train_data_per_200/1447.tfrecords"
        string_val: "./topology/tfrecords/train_data_per_200/1448.tfrecords"
        string_val: "./topology/tfrecords/train_data_per_200/1449.tfrecords"
        string_val: "./topology/tfrecords/train_data_per_200/144.tfrecords"
        string_val: "./topology/tfrecords/train_data_per_200/1451.tfrecords"
        string_val: "./topology/tfrecords/train_data_per_200/1452.tfrecords"
        string_val: "./topology/tfrecords/train_data_per_200/1453.tfrecords"
        string_val: "./topology/tfrecords/train_data_per_200/1454.tfrecords"
        string_val: "./topology/tfrecords/train_data_per_200/1455.tfrecords"
        string_val: "./topology/tfrecords/train_data_per_200/1456.tfrecords"
        string_val: "./topology/tfrecords/train_data_per_200/1459.tfrecords"
        string_val: "./topology/tfrecords/train_data_per_200/145.tfrecords"
        string_val: "./topology/tfrecords/train_data_per_200/1460.tfrecords"
        string_val: "./topology/tfrecords/train_data_per_200/1461.tfrecords"
        string_val: "./topology/tfrecords/train_data_per_200/1462.tfrecords"
        string_val: "./topology/tfrecords/train_data_per_200/1463.tfrecords"
        string_val: "./topology/tfrecords/train_data_per_200/1465.tfrecords"
        string_val: "./topology/tfrecords/train_data_per_200/1466.tfrecords"
        string_val: "./topology/tfrecords/train_data_per_200/1467.tfrecords"
        string_val: "./topology/tfrecords/train_data_per_200/1468.tfrecords"
        string_val: "./topology/tfrecords/train_data_per_200/1469.tfrecords"
        string_val: "./topology/tfrecords/train_data_per_200/146.tfrecords"
        string_val: "./topology/tfrecords/train_data_per_200/1470.tfrecords"
        string_val: "./topology/tfrecords/train_data_per_200/1472.tfrecords"
        string_val: "./topology/tfrecords/train_data_per_200/1473.tfrecords"
        string_val: "./topology/tfrecords/train_data_per_200/1474.tfrecords"
        string_val: "./topology/tfrecords/train_data_per_200/1476.tfrecords"
        string_val: "./topology/tfrecords/train_data_per_200/1477.tfrecords"
        string_val: "./topology/tfrecords/train_data_per_200/1478.tfrecords"
        string_val: "./topology/tfrecords/train_data_per_200/1479.tfrecords"
        string_val: "./topology/tfrecords/train_data_per_200/147.tfrecords"
        string_val: "./topology/tfrecords/train_data_per_200/1480.tfrecords"
        string_val: "./topology/tfrecords/train_data_per_200/1482.tfrecords"
        string_val: "./topology/tfrecords/train_data_per_200/1483.tfrecords"
        string_val: "./topology/tfrecords/train_data_per_200/1484.tfrecords"
        string_val: "./topology/tfrecords/train_data_per_200/1486.tfrecords"
        string_val: "./topology/tfrecords/train_data_per_200/1487.tfrecords"
        string_val: "./topology/tfrecords/train_data_per_200/1488.tfrecords"
        string_val: "./topology/tfrecords/train_data_per_200/1489.tfrecords"
        string_val: "./topology/tfrecords/train_data_per_200/1490.tfrecords"
        string_val: "./topology/tfrecords/train_data_per_200/1491.tfrecords"
        string_val: "./topology/tfrecords/train_data_per_200/1492.tfrecords"
        string_val: "./topology/tfrecords/train_data_per_200/1494.tfrecords"
        string_val: "./topology/tfrecords/train_data_per_200/1496.tfrecords"
        string_val: "./topology/tfrecords/train_data_per_200/1497.tfrecords"
        string_val: "./topology/tfrecords/train_data_per_200/149.tfrecords"
        string_val: "./topology/tfrecords/train_data_per_200/1500.tfrecords"
        string_val: "./topology/tfrecords/train_data_per_200/1501.tfrecords"
        string_val: "./topology/tfrecords/train_data_per_200/1502.tfrecords"
        string_val: "./topology/tfrecords/train_data_per_200/1503.tfrecords"
        string_val: "./topology/tfrecords/train_data_per_200/1505.tfrecords"
        string_val: "./topology/tfrecords/train_data_per_200/1507.tfrecords"
        string_val: "./topology/tfrecords/train_data_per_200/1508.tfrecords"
        string_val: "./topology/tfrecords/train_data_per_200/1509.tfrecords"
        string_val: "./topology/tfrecords/train_data_per_200/150.tfrecords"
        string_val: "./topology/tfrecords/train_data_per_200/1510.tfrecords"
        string_val: "./topology/tfrecords/train_data_per_200/1511.tfrecords"
        string_val: "./topology/tfrecords/train_data_per_200/1512.tfrecords"
        string_val: "./topology/tfrecords/train_data_per_200/1513.tfrecords"
        string_val: "./topology/tfrecords/train_data_per_200/1514.tfrecords"
        string_val: "./topology/tfrecords/train_data_per_200/1515.tfrecords"
        string_val: "./topology/tfrecords/train_data_per_200/1516.tfrecords"
        string_val: "./topology/tfrecords/train_data_per_200/1518.tfrecords"
        string_val: "./topology/tfrecords/train_data_per_200/1519.tfrecords"
        string_val: "./topology/tfrecords/train_data_per_200/151.tfrecords"
        string_val: "./topology/tfrecords/train_data_per_200/1520.tfrecords"
        string_val: "./topology/tfrecords/train_data_per_200/1522.tfrecords"
        string_val: "./topology/tfrecords/train_data_per_200/1523.tfrecords"
        string_val: "./topology/tfrecords/train_data_per_200/1524.tfrecords"
        string_val: "./topology/tfrecords/train_data_per_200/1525.tfrecords"
        string_val: "./topology/tfrecords/train_data_per_200/1526.tfrecords"
        string_val: "./topology/tfrecords/train_data_per_200/1527.tfrecords"
        string_val: "./topology/tfrecords/train_data_per_200/152.tfrecords"
        string_val: "./topology/tfrecords/train_data_per_200/1530.tfrecords"
        string_val: "./topology/tfrecords/train_data_per_200/1531.tfrecords"
        string_val: "./topology/tfrecords/train_data_per_200/1535.tfrecords"
        string_val: "./topology/tfrecords/train_data_per_200/1536.tfrecords"
        string_val: "./topology/tfrecords/train_data_per_200/1538.tfrecords"
        string_val: "./topology/tfrecords/train_data_per_200/1539.tfrecords"
        string_val: "./topology/tfrecords/train_data_per_200/1540.tfrecords"
        string_val: "./topology/tfrecords/train_data_per_200/1541.tfrecords"
        string_val: "./topology/tfrecords/train_data_per_200/1542.tfrecords"
        string_val: "./topology/tfrecords/train_data_per_200/1543.tfrecords"
        string_val: "./topology/tfrecords/train_data_per_200/1544.tfrecords"
        string_val: "./topology/tfrecords/train_data_per_200/1545.tfrecords"
        string_val: "./topology/tfrecords/train_data_per_200/1548.tfrecords"
        string_val: "./topology/tfrecords/train_data_per_200/1549.tfrecords"
        string_val: "./topology/tfrecords/train_data_per_200/154.tfrecords"
        string_val: "./topology/tfrecords/train_data_per_200/1550.tfrecords"
        string_val: "./topology/tfrecords/train_data_per_200/1551.tfrecords"
        string_val: "./topology/tfrecords/train_data_per_200/1553.tfrecords"
        string_val: "./topology/tfrecords/train_data_per_200/1554.tfrecords"
        string_val: "./topology/tfrecords/train_data_per_200/1555.tfrecords"
        string_val: "./topology/tfrecords/train_data_per_200/1557.tfrecords"
        string_val: "./topology/tfrecords/train_data_per_200/1558.tfrecords"
        string_val: "./topology/tfrecords/train_data_per_200/1559.tfrecords"
        string_val: "./topology/tfrecords/train_data_per_200/155.tfrecords"
        string_val: "./topology/tfrecords/train_data_per_200/1561.tfrecords"
        string_val: "./topology/tfrecords/train_data_per_200/1562.tfrecords"
        string_val: "./topology/tfrecords/train_data_per_200/1563.tfrecords"
        string_val: "./topology/tfrecords/train_data_per_200/1564.tfrecords"
        string_val: "./topology/tfrecords/train_data_per_200/1565.tfrecords"
        string_val: "./topology/tfrecords/train_data_per_200/1566.tfrecords"
        string_val: "./topology/tfrecords/train_data_per_200/1567.tfrecords"
        string_val: "./topology/tfrecords/train_data_per_200/1568.tfrecords"
        string_val: "./topology/tfrecords/train_data_per_200/1569.tfrecords"
        string_val: "./topology/tfrecords/train_data_per_200/1570.tfrecords"
        string_val: "./topology/tfrecords/train_data_per_200/1571.tfrecords"
        string_val: "./topology/tfrecords/train_data_per_200/1573.tfrecords"
        string_val: "./topology/tfrecords/train_data_per_200/1575.tfrecords"
        string_val: "./topology/tfrecords/train_data_per_200/1576.tfrecords"
        string_val: "./topology/tfrecords/train_data_per_200/1577.tfrecords"
        string_val: "./topology/tfrecords/train_data_per_200/1578.tfrecords"
        string_val: "./topology/tfrecords/train_data_per_200/1579.tfrecords"
        string_val: "./topology/tfrecords/train_data_per_200/1580.tfrecords"
        string_val: "./topology/tfrecords/train_data_per_200/1581.tfrecords"
        string_val: "./topology/tfrecords/train_data_per_200/1582.tfrecords"
        string_val: "./topology/tfrecords/train_data_per_200/1583.tfrecords"
        string_val: "./topology/tfrecords/train_data_per_200/1585.tfrecords"
        string_val: "./topology/tfrecords/train_data_per_200/1586.tfrecords"
        string_val: "./topology/tfrecords/train_data_per_200/1589.tfrecords"
        string_val: "./topology/tfrecords/train_data_per_200/158.tfrecords"
        string_val: "./topology/tfrecords/train_data_per_200/1590.tfrecords"
        string_val: "./topology/tfrecords/train_data_per_200/1592.tfrecords"
        string_val: "./topology/tfrecords/train_data_per_200/1593.tfrecords"
        string_val: "./topology/tfrecords/train_data_per_200/1594.tfrecords"
        string_val: "./topology/tfrecords/train_data_per_200/1595.tfrecords"
        string_val: "./topology/tfrecords/train_data_per_200/1596.tfrecords"
        string_val: "./topology/tfrecords/train_data_per_200/1599.tfrecords"
        string_val: "./topology/tfrecords/train_data_per_200/159.tfrecords"
        string_val: "./topology/tfrecords/train_data_per_200/15.tfrecords"
        string_val: "./topology/tfrecords/train_data_per_200/1600.tfrecords"
        string_val: "./topology/tfrecords/train_data_per_200/1601.tfrecords"
        string_val: "./topology/tfrecords/train_data_per_200/1603.tfrecords"
        string_val: "./topology/tfrecords/train_data_per_200/1604.tfrecords"
        string_val: "./topology/tfrecords/train_data_per_200/1605.tfrecords"
        string_val: "./topology/tfrecords/train_data_per_200/1606.tfrecords"
        string_val: "./topology/tfrecords/train_data_per_200/1607.tfrecords"
        string_val: "./topology/tfrecords/train_data_per_200/1608.tfrecords"
        string_val: "./topology/tfrecords/train_data_per_200/1609.tfrecords"
        string_val: "./topology/tfrecords/train_data_per_200/1610.tfrecords"
        string_val: "./topology/tfrecords/train_data_per_200/1611.tfrecords"
        string_val: "./topology/tfrecords/train_data_per_200/1612.tfrecords"
        string_val: "./topology/tfrecords/train_data_per_200/1613.tfrecords"
        string_val: "./topology/tfrecords/train_data_per_200/1614.tfrecords"
        string_val: "./topology/tfrecords/train_data_per_200/1615.tfrecords"
        string_val: "./topology/tfrecords/train_data_per_200/1617.tfrecords"
        string_val: "./topology/tfrecords/train_data_per_200/1620.tfrecords"
        string_val: "./topology/tfrecords/train_data_per_200/1622.tfrecords"
        string_val: "./topology/tfrecords/train_data_per_200/1623.tfrecords"
        string_val: "./topology/tfrecords/train_data_per_200/1624.tfrecords"
        string_val: "./topology/tfrecords/train_data_per_200/1626.tfrecords"
        string_val: "./topology/tfrecords/train_data_per_200/1627.tfrecords"
        string_val: "./topology/tfrecords/train_data_per_200/1628.tfrecords"
        string_val: "./topology/tfrecords/train_data_per_200/1629.tfrecords"
        string_val: "./topology/tfrecords/train_data_per_200/162.tfrecords"
        string_val: "./topology/tfrecords/train_data_per_200/1630.tfrecords"
        string_val: "./topology/tfrecords/train_data_per_200/1631.tfrecords"
        string_val: "./topology/tfrecords/train_data_per_200/1633.tfrecords"
        string_val: "./topology/tfrecords/train_data_per_200/1634.tfrecords"
        string_val: "./topology/tfrecords/train_data_per_200/1635.tfrecords"
        string_val: "./topology/tfrecords/train_data_per_200/1636.tfrecords"
        string_val: "./topology/tfrecords/train_data_per_200/1637.tfrecords"
        string_val: "./topology/tfrecords/train_data_per_200/1638.tfrecords"
        string_val: "./topology/tfrecords/train_data_per_200/1639.tfrecords"
        string_val: "./topology/tfrecords/train_data_per_200/163.tfrecords"
        string_val: "./topology/tfrecords/train_data_per_200/1641.tfrecords"
        string_val: "./topology/tfrecords/train_data_per_200/1642.tfrecords"
        string_val: "./topology/tfrecords/train_data_per_200/1643.tfrecords"
        string_val: "./topology/tfrecords/train_data_per_200/1644.tfrecords"
        string_val: "./topology/tfrecords/train_data_per_200/1645.tfrecords"
        string_val: "./topology/tfrecords/train_data_per_200/1647.tfrecords"
