node {
  name: "global_step/Initializer/zeros"
  op: "Const"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@global_step"
      }
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_INT64
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT64
        tensor_shape {
        }
        int64_val: 0
      }
    }
  }
}
node {
  name: "global_step"
  op: "VariableV2"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@global_step"
      }
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_INT64
    }
  }
  attr {
    key: "shape"
    value {
      shape {
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: ""
    }
  }
}
node {
  name: "global_step/Assign"
  op: "Assign"
  input: "global_step"
  input: "global_step/Initializer/zeros"
  attr {
    key: "T"
    value {
      type: DT_INT64
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@global_step"
      }
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
  attr {
    key: "use_locking"
    value {
      b: true
    }
  }
  attr {
    key: "validate_shape"
    value {
      b: true
    }
  }
}
node {
  name: "global_step/read"
  op: "Identity"
  input: "global_step"
  attr {
    key: "T"
    value {
      type: DT_INT64
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@global_step"
      }
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
}
node {
  name: "global_step/IsVariableInitialized"
  op: "IsVariableInitialized"
  input: "global_step"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@global_step"
      }
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_INT64
    }
  }
}
node {
  name: "global_step/cond/Switch"
  op: "Switch"
  input: "global_step/IsVariableInitialized"
  input: "global_step/IsVariableInitialized"
  attr {
    key: "T"
    value {
      type: DT_BOOL
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
        shape {
        }
      }
    }
  }
}
node {
  name: "global_step/cond/switch_t"
  op: "Identity"
  input: "global_step/cond/Switch:1"
  attr {
    key: "T"
    value {
      type: DT_BOOL
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
}
node {
  name: "global_step/cond/switch_f"
  op: "Identity"
  input: "global_step/cond/Switch"
  attr {
    key: "T"
    value {
      type: DT_BOOL
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
}
node {
  name: "global_step/cond/pred_id"
  op: "Identity"
  input: "global_step/IsVariableInitialized"
  attr {
    key: "T"
    value {
      type: DT_BOOL
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
}
node {
  name: "global_step/cond/read"
  op: "Identity"
  input: "global_step/cond/read/Switch:1"
  attr {
    key: "T"
    value {
      type: DT_INT64
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
}
node {
  name: "global_step/cond/read/Switch"
  op: "RefSwitch"
  input: "global_step"
  input: "global_step/cond/pred_id"
  attr {
    key: "T"
    value {
      type: DT_INT64
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@global_step"
      }
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
        shape {
        }
      }
    }
  }
}
node {
  name: "global_step/cond/Switch_1"
  op: "Switch"
  input: "global_step/Initializer/zeros"
  input: "global_step/cond/pred_id"
  attr {
    key: "T"
    value {
      type: DT_INT64
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@global_step"
      }
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
        shape {
        }
      }
    }
  }
}
node {
  name: "global_step/cond/Merge"
  op: "Merge"
  input: "global_step/cond/Switch_1"
  input: "global_step/cond/read"
  attr {
    key: "N"
    value {
      i: 2
    }
  }
  attr {
    key: "T"
    value {
      type: DT_INT64
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
        shape {
        }
      }
    }
  }
}
node {
  name: "global_step/add/y"
  op: "Const"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_INT64
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT64
        tensor_shape {
        }
        int64_val: 0
      }
    }
  }
}
node {
  name: "global_step/add"
  op: "Add"
  input: "global_step/cond/Merge"
  input: "global_step/add/y"
  attr {
    key: "T"
    value {
      type: DT_INT64
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
}
node {
  name: "tensors/normalize_tensors/component_0"
  op: "Const"
  device: "/device:CPU:0"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 345
          }
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_STRING
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_STRING
        tensor_shape {
          dim {
            size: 345
          }
        }
        string_val: "topology/tfrecords/mix/1001.tfrecords"
        string_val: "topology/tfrecords/mix/1002.tfrecords"
        string_val: "topology/tfrecords/mix/1003.tfrecords"
        string_val: "topology/tfrecords/mix/1005.tfrecords"
        string_val: "topology/tfrecords/mix/1006.tfrecords"
        string_val: "topology/tfrecords/mix/1007.tfrecords"
        string_val: "topology/tfrecords/mix/1008.tfrecords"
        string_val: "topology/tfrecords/mix/1009.tfrecords"
        string_val: "topology/tfrecords/mix/100.tfrecords"
        string_val: "topology/tfrecords/mix/1010.tfrecords"
        string_val: "topology/tfrecords/mix/1011.tfrecords"
        string_val: "topology/tfrecords/mix/1013.tfrecords"
        string_val: "topology/tfrecords/mix/1014.tfrecords"
        string_val: "topology/tfrecords/mix/1016.tfrecords"
        string_val: "topology/tfrecords/mix/1017.tfrecords"
        string_val: "topology/tfrecords/mix/1018.tfrecords"
        string_val: "topology/tfrecords/mix/1019.tfrecords"
        string_val: "topology/tfrecords/mix/101.tfrecords"
        string_val: "topology/tfrecords/mix/1021.tfrecords"
        string_val: "topology/tfrecords/mix/1022.tfrecords"
        string_val: "topology/tfrecords/mix/1023.tfrecords"
        string_val: "topology/tfrecords/mix/1024.tfrecords"
        string_val: "topology/tfrecords/mix/1026.tfrecords"
        string_val: "topology/tfrecords/mix/1027.tfrecords"
        string_val: "topology/tfrecords/mix/1028.tfrecords"
        string_val: "topology/tfrecords/mix/1029.tfrecords"
        string_val: "topology/tfrecords/mix/102.tfrecords"
        string_val: "topology/tfrecords/mix/1030.tfrecords"
        string_val: "topology/tfrecords/mix/1031.tfrecords"
        string_val: "topology/tfrecords/mix/1032.tfrecords"
        string_val: "topology/tfrecords/mix/1033.tfrecords"
        string_val: "topology/tfrecords/mix/1034.tfrecords"
        string_val: "topology/tfrecords/mix/1035.tfrecords"
        string_val: "topology/tfrecords/mix/1036.tfrecords"
        string_val: "topology/tfrecords/mix/1038.tfrecords"
        string_val: "topology/tfrecords/mix/1039.tfrecords"
        string_val: "topology/tfrecords/mix/1040.tfrecords"
        string_val: "topology/tfrecords/mix/1041.tfrecords"
        string_val: "topology/tfrecords/mix/1042.tfrecords"
        string_val: "topology/tfrecords/mix/1043.tfrecords"
        string_val: "topology/tfrecords/mix/1045.tfrecords"
        string_val: "topology/tfrecords/mix/1048.tfrecords"
        string_val: "topology/tfrecords/mix/1049.tfrecords"
        string_val: "topology/tfrecords/mix/104.tfrecords"
        string_val: "topology/tfrecords/mix/1051.tfrecords"
        string_val: "topology/tfrecords/mix/1052.tfrecords"
        string_val: "topology/tfrecords/mix/1053.tfrecords"
        string_val: "topology/tfrecords/mix/1054.tfrecords"
        string_val: "topology/tfrecords/mix/1055.tfrecords"
        string_val: "topology/tfrecords/mix/1056.tfrecords"
        string_val: "topology/tfrecords/mix/1058.tfrecords"
        string_val: "topology/tfrecords/mix/1059.tfrecords"
        string_val: "topology/tfrecords/mix/105.tfrecords"
        string_val: "topology/tfrecords/mix/1060.tfrecords"
        string_val: "topology/tfrecords/mix/1061.tfrecords"
        string_val: "topology/tfrecords/mix/1062.tfrecords"
        string_val: "topology/tfrecords/mix/1063.tfrecords"
        string_val: "topology/tfrecords/mix/1064.tfrecords"
        string_val: "topology/tfrecords/mix/1066.tfrecords"
        string_val: "topology/tfrecords/mix/1067.tfrecords"
        string_val: "topology/tfrecords/mix/1068.tfrecords"
        string_val: "topology/tfrecords/mix/1069.tfrecords"
        string_val: "topology/tfrecords/mix/106.tfrecords"
        string_val: "topology/tfrecords/mix/1070.tfrecords"
        string_val: "topology/tfrecords/mix/1072.tfrecords"
        string_val: "topology/tfrecords/mix/1074.tfrecords"
        string_val: "topology/tfrecords/mix/1075.tfrecords"
        string_val: "topology/tfrecords/mix/1076.tfrecords"
        string_val: "topology/tfrecords/mix/1077.tfrecords"
        string_val: "topology/tfrecords/mix/1078.tfrecords"
        string_val: "topology/tfrecords/mix/1079.tfrecords"
        string_val: "topology/tfrecords/mix/107.tfrecords"
        string_val: "topology/tfrecords/mix/1080.tfrecords"
        string_val: "topology/tfrecords/mix/1081.tfrecords"
        string_val: "topology/tfrecords/mix/1083.tfrecords"
        string_val: "topology/tfrecords/mix/1085.tfrecords"
        string_val: "topology/tfrecords/mix/1086.tfrecords"
        string_val: "topology/tfrecords/mix/1087.tfrecords"
        string_val: "topology/tfrecords/mix/1089.tfrecords"
        string_val: "topology/tfrecords/mix/108.tfrecords"
        string_val: "topology/tfrecords/mix/1090.tfrecords"
        string_val: "topology/tfrecords/mix/1091.tfrecords"
        string_val: "topology/tfrecords/mix/1092.tfrecords"
        string_val: "topology/tfrecords/mix/1093.tfrecords"
        string_val: "topology/tfrecords/mix/1095.tfrecords"
        string_val: "topology/tfrecords/mix/1096.tfrecords"
        string_val: "topology/tfrecords/mix/1097.tfrecords"
        string_val: "topology/tfrecords/mix/1099.tfrecords"
        string_val: "topology/tfrecords/mix/109.tfrecords"
        string_val: "topology/tfrecords/mix/10.tfrecords"
        string_val: "topology/tfrecords/mix/1100.tfrecords"
        string_val: "topology/tfrecords/mix/1102.tfrecords"
        string_val: "topology/tfrecords/mix/1104.tfrecords"
        string_val: "topology/tfrecords/mix/1106.tfrecords"
        string_val: "topology/tfrecords/mix/1107.tfrecords"
        string_val: "topology/tfrecords/mix/1108.tfrecords"
        string_val: "topology/tfrecords/mix/110.tfrecords"
        string_val: "topology/tfrecords/mix/1111.tfrecords"
        string_val: "topology/tfrecords/mix/1112.tfrecords"
        string_val: "topology/tfrecords/mix/1113.tfrecords"
        string_val: "topology/tfrecords/mix/1114.tfrecords"
        string_val: "topology/tfrecords/mix/1115.tfrecords"
        string_val: "topology/tfrecords/mix/1116.tfrecords"
        string_val: "topology/tfrecords/mix/1117.tfrecords"
        string_val: "topology/tfrecords/mix/1118.tfrecords"
        string_val: "topology/tfrecords/mix/1119.tfrecords"
        string_val: "topology/tfrecords/mix/111.tfrecords"
        string_val: "topology/tfrecords/mix/1120.tfrecords"
        string_val: "topology/tfrecords/mix/1122.tfrecords"
        string_val: "topology/tfrecords/mix/1123.tfrecords"
        string_val: "topology/tfrecords/mix/1124.tfrecords"
        string_val: "topology/tfrecords/mix/1126.tfrecords"
        string_val: "topology/tfrecords/mix/1127.tfrecords"
        string_val: "topology/tfrecords/mix/1128.tfrecords"
        string_val: "topology/tfrecords/mix/112.tfrecords"
        string_val: "topology/tfrecords/mix/1132.tfrecords"
        string_val: "topology/tfrecords/mix/1133.tfrecords"
        string_val: "topology/tfrecords/mix/1134.tfrecords"
        string_val: "topology/tfrecords/mix/1135.tfrecords"
        string_val: "topology/tfrecords/mix/1136.tfrecords"
        string_val: "topology/tfrecords/mix/1137.tfrecords"
        string_val: "topology/tfrecords/mix/1138.tfrecords"
        string_val: "topology/tfrecords/mix/1139.tfrecords"
        string_val: "topology/tfrecords/mix/113.tfrecords"
        string_val: "topology/tfrecords/mix/1140.tfrecords"
        string_val: "topology/tfrecords/mix/1142.tfrecords"
        string_val: "topology/tfrecords/mix/1144.tfrecords"
        string_val: "topology/tfrecords/mix/1145.tfrecords"
        string_val: "topology/tfrecords/mix/1146.tfrecords"
        string_val: "topology/tfrecords/mix/1147.tfrecords"
        string_val: "topology/tfrecords/mix/1148.tfrecords"
        string_val: "topology/tfrecords/mix/1149.tfrecords"
        string_val: "topology/tfrecords/mix/114.tfrecords"
        string_val: "topology/tfrecords/mix/1151.tfrecords"
        string_val: "topology/tfrecords/mix/1152.tfrecords"
        string_val: "topology/tfrecords/mix/1153.tfrecords"
        string_val: "topology/tfrecords/mix/1155.tfrecords"
        string_val: "topology/tfrecords/mix/1157.tfrecords"
        string_val: "topology/tfrecords/mix/1158.tfrecords"
        string_val: "topology/tfrecords/mix/1159.tfrecords"
        string_val: "topology/tfrecords/mix/115.tfrecords"
        string_val: "topology/tfrecords/mix/1160.tfrecords"
        string_val: "topology/tfrecords/mix/1161.tfrecords"
        string_val: "topology/tfrecords/mix/1162.tfrecords"
        string_val: "topology/tfrecords/mix/1165.tfrecords"
        string_val: "topology/tfrecords/mix/1166.tfrecords"
        string_val: "topology/tfrecords/mix/1167.tfrecords"
        string_val: "topology/tfrecords/mix/1169.tfrecords"
        string_val: "topology/tfrecords/mix/116.tfrecords"
        string_val: "topology/tfrecords/mix/1170.tfrecords"
        string_val: "topology/tfrecords/mix/1171.tfrecords"
        string_val: "topology/tfrecords/mix/1172.tfrecords"
        string_val: "topology/tfrecords/mix/1173.tfrecords"
        string_val: "topology/tfrecords/mix/1176.tfrecords"
        string_val: "topology/tfrecords/mix/1178.tfrecords"
        string_val: "topology/tfrecords/mix/1179.tfrecords"
        string_val: "topology/tfrecords/mix/117.tfrecords"
        string_val: "topology/tfrecords/mix/1180.tfrecords"
        string_val: "topology/tfrecords/mix/1181.tfrecords"
        string_val: "topology/tfrecords/mix/1182.tfrecords"
        string_val: "topology/tfrecords/mix/1184.tfrecords"
        string_val: "topology/tfrecords/mix/1185.tfrecords"
        string_val: "topology/tfrecords/mix/1186.tfrecords"
        string_val: "topology/tfrecords/mix/1187.tfrecords"
        string_val: "topology/tfrecords/mix/1188.tfrecords"
        string_val: "topology/tfrecords/mix/1189.tfrecords"
        string_val: "topology/tfrecords/mix/118.tfrecords"
        string_val: "topology/tfrecords/mix/1190.tfrecords"
        string_val: "topology/tfrecords/mix/1191.tfrecords"
        string_val: "topology/tfrecords/mix/1192.tfrecords"
        string_val: "topology/tfrecords/mix/1193.tfrecords"
        string_val: "topology/tfrecords/mix/1194.tfrecords"
        string_val: "topology/tfrecords/mix/1195.tfrecords"
        string_val: "topology/tfrecords/mix/1196.tfrecords"
        string_val: "topology/tfrecords/mix/1197.tfrecords"
        string_val: "topology/tfrecords/mix/1198.tfrecords"
        string_val: "topology/tfrecords/mix/1199.tfrecords"
        string_val: "topology/tfrecords/mix/119.tfrecords"
        string_val: "topology/tfrecords/mix/11.tfrecords"
        string_val: "topology/tfrecords/mix/1200.tfrecords"
        string_val: "topology/tfrecords/mix/1201.tfrecords"
        string_val: "topology/tfrecords/mix/1202.tfrecords"
        string_val: "topology/tfrecords/mix/1203.tfrecords"
        string_val: "topology/tfrecords/mix/1204.tfrecords"
        string_val: "topology/tfrecords/mix/1206.tfrecords"
        string_val: "topology/tfrecords/mix/1207.tfrecords"
        string_val: "topology/tfrecords/mix/1208.tfrecords"
        string_val: "topology/tfrecords/mix/1209.tfrecords"
        string_val: "topology/tfrecords/mix/120.tfrecords"
        string_val: "topology/tfrecords/mix/1210.tfrecords"
        string_val: "topology/tfrecords/mix/1211.tfrecords"
        string_val: "topology/tfrecords/mix/1212.tfrecords"
        string_val: "topology/tfrecords/mix/1213.tfrecords"
        string_val: "topology/tfrecords/mix/1214.tfrecords"
        string_val: "topology/tfrecords/mix/1215.tfrecords"
        string_val: "topology/tfrecords/mix/1216.tfrecords"
        string_val: "topology/tfrecords/mix/1217.tfrecords"
        string_val: "topology/tfrecords/mix/121.tfrecords"
        string_val: "topology/tfrecords/mix/1220.tfrecords"
        string_val: "topology/tfrecords/mix/1221.tfrecords"
        string_val: "topology/tfrecords/mix/1222.tfrecords"
        string_val: "topology/tfrecords/mix/1223.tfrecords"
        string_val: "topology/tfrecords/mix/122.tfrecords"
        string_val: "topology/tfrecords/mix/123.tfrecords"
        string_val: "topology/tfrecords/mix/124.tfrecords"
        string_val: "topology/tfrecords/mix/125.tfrecords"
        string_val: "topology/tfrecords/mix/126.tfrecords"
        string_val: "topology/tfrecords/mix/127.tfrecords"
        string_val: "topology/tfrecords/mix/12.tfrecords"
        string_val: "topology/tfrecords/mix/130.tfrecords"
        string_val: "topology/tfrecords/mix/131.tfrecords"
        string_val: "topology/tfrecords/mix/132.tfrecords"
        string_val: "topology/tfrecords/mix/133.tfrecords"
        string_val: "topology/tfrecords/mix/135.tfrecords"
        string_val: "topology/tfrecords/mix/136.tfrecords"
        string_val: "topology/tfrecords/mix/137.tfrecords"
        string_val: "topology/tfrecords/mix/138.tfrecords"
        string_val: "topology/tfrecords/mix/139.tfrecords"
        string_val: "topology/tfrecords/mix/13.tfrecords"
        string_val: "topology/tfrecords/mix/140.tfrecords"
        string_val: "topology/tfrecords/mix/141.tfrecords"
        string_val: "topology/tfrecords/mix/142.tfrecords"
        string_val: "topology/tfrecords/mix/143.tfrecords"
        string_val: "topology/tfrecords/mix/145.tfrecords"
        string_val: "topology/tfrecords/mix/146.tfrecords"
        string_val: "topology/tfrecords/mix/147.tfrecords"
        string_val: "topology/tfrecords/mix/148.tfrecords"
        string_val: "topology/tfrecords/mix/151.tfrecords"
        string_val: "topology/tfrecords/mix/154.tfrecords"
        string_val: "topology/tfrecords/mix/155.tfrecords"
        string_val: "topology/tfrecords/mix/156.tfrecords"
        string_val: "topology/tfrecords/mix/157.tfrecords"
        string_val: "topology/tfrecords/mix/158.tfrecords"
        string_val: "topology/tfrecords/mix/15.tfrecords"
        string_val: "topology/tfrecords/mix/160.tfrecords"
        string_val: "topology/tfrecords/mix/162.tfrecords"
        string_val: "topology/tfrecords/mix/163.tfrecords"
        string_val: "topology/tfrecords/mix/164.tfrecords"
        string_val: "topology/tfrecords/mix/165.tfrecords"
        string_val: "topology/tfrecords/mix/167.tfrecords"
        string_val: "topology/tfrecords/mix/168.tfrecords"
        string_val: "topology/tfrecords/mix/171.tfrecords"
        string_val: "topology/tfrecords/mix/173.tfrecords"
        string_val: "topology/tfrecords/mix/174.tfrecords"
        string_val: "topology/tfrecords/mix/175.tfrecords"
        string_val: "topology/tfrecords/mix/176.tfrecords"
        string_val: "topology/tfrecords/mix/177.tfrecords"
        string_val: "topology/tfrecords/mix/178.tfrecords"
        string_val: "topology/tfrecords/mix/179.tfrecords"
        string_val: "topology/tfrecords/mix/17.tfrecords"
        string_val: "topology/tfrecords/mix/180.tfrecords"
        string_val: "topology/tfrecords/mix/181.tfrecords"
        string_val: "topology/tfrecords/mix/183.tfrecords"
        string_val: "topology/tfrecords/mix/184.tfrecords"
        string_val: "topology/tfrecords/mix/185.tfrecords"
        string_val: "topology/tfrecords/mix/186.tfrecords"
        string_val: "topology/tfrecords/mix/187.tfrecords"
        string_val: "topology/tfrecords/mix/188.tfrecords"
        string_val: "topology/tfrecords/mix/189.tfrecords"
        string_val: "topology/tfrecords/mix/191.tfrecords"
        string_val: "topology/tfrecords/mix/192.tfrecords"
        string_val: "topology/tfrecords/mix/193.tfrecords"
        string_val: "topology/tfrecords/mix/194.tfrecords"
        string_val: "topology/tfrecords/mix/195.tfrecords"
        string_val: "topology/tfrecords/mix/197.tfrecords"
        string_val: "topology/tfrecords/mix/198.tfrecords"
        string_val: "topology/tfrecords/mix/199.tfrecords"
        string_val: "topology/tfrecords/mix/19.tfrecords"
        string_val: "topology/tfrecords/mix/1.tfrecords"
        string_val: "topology/tfrecords/mix/20.tfrecords"
        string_val: "topology/tfrecords/mix/21.tfrecords"
        string_val: "topology/tfrecords/mix/22.tfrecords"
        string_val: "topology/tfrecords/mix/23.tfrecords"
        string_val: "topology/tfrecords/mix/24.tfrecords"
        string_val: "topology/tfrecords/mix/25.tfrecords"
        string_val: "topology/tfrecords/mix/26.tfrecords"
        string_val: "topology/tfrecords/mix/27.tfrecords"
        string_val: "topology/tfrecords/mix/28.tfrecords"
        string_val: "topology/tfrecords/mix/29.tfrecords"
        string_val: "topology/tfrecords/mix/2.tfrecords"
        string_val: "topology/tfrecords/mix/30.tfrecords"
        string_val: "topology/tfrecords/mix/31.tfrecords"
        string_val: "topology/tfrecords/mix/32.tfrecords"
        string_val: "topology/tfrecords/mix/33.tfrecords"
        string_val: "topology/tfrecords/mix/34.tfrecords"
        string_val: "topology/tfrecords/mix/35.tfrecords"
        string_val: "topology/tfrecords/mix/37.tfrecords"
        string_val: "topology/tfrecords/mix/38.tfrecords"
        string_val: "topology/tfrecords/mix/39.tfrecords"
        string_val: "topology/tfrecords/mix/3.tfrecords"
        string_val: "topology/tfrecords/mix/40.tfrecords"
        string_val: "topology/tfrecords/mix/41.tfrecords"
        string_val: "topology/tfrecords/mix/42.tfrecords"
        string_val: "topology/tfrecords/mix/44.tfrecords"
        string_val: "topology/tfrecords/mix/45.tfrecords"
        string_val: "topology/tfrecords/mix/46.tfrecords"
        string_val: "topology/tfrecords/mix/48.tfrecords"
        string_val: "topology/tfrecords/mix/4.tfrecords"
        string_val: "topology/tfrecords/mix/50.tfrecords"
        string_val: "topology/tfrecords/mix/51.tfrecords"
        string_val: "topology/tfrecords/mix/52.tfrecords"
        string_val: "topology/tfrecords/mix/53.tfrecords"
        string_val: "topology/tfrecords/mix/54.tfrecords"
        string_val: "topology/tfrecords/mix/55.tfrecords"
        string_val: "topology/tfrecords/mix/56.tfrecords"
        string_val: "topology/tfrecords/mix/58.tfrecords"
        string_val: "topology/tfrecords/mix/5.tfrecords"
        string_val: "topology/tfrecords/mix/61.tfrecords"
        string_val: "topology/tfrecords/mix/63.tfrecords"
        string_val: "topology/tfrecords/mix/64.tfrecords"
        string_val: "topology/tfrecords/mix/65.tfrecords"
        string_val: "topology/tfrecords/mix/67.tfrecords"
        string_val: "topology/tfrecords/mix/68.tfrecords"
        string_val: "topology/tfrecords/mix/69.tfrecords"
        string_val: "topology/tfrecords/mix/6.tfrecords"
        string_val: "topology/tfrecords/mix/70.tfrecords"
        string_val: "topology/tfrecords/mix/71.tfrecords"
        string_val: "topology/tfrecords/mix/73.tfrecords"
        string_val: "topology/tfrecords/mix/74.tfrecords"
        string_val: "topology/tfrecords/mix/76.tfrecords"
        string_val: "topology/tfrecords/mix/77.tfrecords"
        string_val: "topology/tfrecords/mix/79.tfrecords"
        string_val: "topology/tfrecords/mix/7.tfrecords"
        string_val: "topology/tfrecords/mix/80.tfrecords"
        string_val: "topology/tfrecords/mix/81.tfrecords"
        string_val: "topology/tfrecords/mix/82.tfrecords"
        string_val: "topology/tfrecords/mix/83.tfrecords"
        string_val: "topology/tfrecords/mix/84.tfrecords"
        string_val: "topology/tfrecords/mix/85.tfrecords"
        string_val: "topology/tfrecords/mix/86.tfrecords"
        string_val: "topology/tfrecords/mix/87.tfrecords"
        string_val: "topology/tfrecords/mix/88.tfrecords"
        string_val: "topology/tfrecords/mix/89.tfrecords"
        string_val: "topology/tfrecords/mix/8.tfrecords"
        string_val: "topology/tfrecords/mix/90.tfrecords"
        string_val: "topology/tfrecords/mix/91.tfrecords"
        string_val: "topology/tfrecords/mix/92.tfrecords"
        string_val: "topology/tfrecords/mix/93.tfrecords"
        string_val: "topology/tfrecords/mix/94.tfrecords"
        string_val: "topology/tfrecords/mix/95.tfrecords"
        string_val: "topology/tfrecords/mix/96.tfrecords"
        string_val: "topology/tfrecords/mix/97.tfrecords"
        string_val: "topology/tfrecords/mix/98.tfrecords"
        string_val: "topology/tfrecords/mix/99.tfrecords"
        string_val: "topology/tfrecords/mix/9.tfrecords"
      }
    }
  }
}
node {
  name: "TensorSliceDataset"
  op: "TensorSliceDataset"
  input: "tensors/normalize_tensors/component_0"
  device: "/device:CPU:0"
  attr {
    key: "Toutput_types"
    value {
      list {
        type: DT_STRING
      }
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
  attr {
    key: "output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
}
node {
  name: "buffer_size"
  op: "Const"
  device: "/device:CPU:0"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_INT64
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT64
        tensor_shape {
        }
        int64_val: 345
      }
    }
  }
}
node {
  name: "seed"
  op: "Const"
  device: "/device:CPU:0"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_INT64
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT64
        tensor_shape {
        }
        int64_val: 0
      }
    }
  }
}
node {
  name: "seed2"
  op: "Const"
  device: "/device:CPU:0"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_INT64
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT64
        tensor_shape {
        }
        int64_val: 0
      }
    }
  }
}
node {
  name: "ShuffleDataset"
  op: "ShuffleDataset"
  input: "TensorSliceDataset"
  input: "buffer_size"
  input: "seed"
  input: "seed2"
  device: "/device:CPU:0"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
  attr {
    key: "output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
  attr {
    key: "output_types"
    value {
      list {
        type: DT_STRING
      }
    }
  }
  attr {
    key: "reshuffle_each_iteration"
    value {
      b: true
    }
  }
}
node {
  name: "cycle_length"
  op: "Const"
  device: "/device:CPU:0"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_INT64
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT64
        tensor_shape {
        }
        int64_val: 4
      }
    }
  }
}
node {
  name: "block_length"
  op: "Const"
  device: "/device:CPU:0"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_INT64
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT64
        tensor_shape {
        }
        int64_val: 1
      }
    }
  }
}
node {
  name: "sloppy"
  op: "Const"
  device: "/device:CPU:0"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_BOOL
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_BOOL
        tensor_shape {
        }
        bool_val: false
      }
    }
  }
}
node {
  name: "buffer_output_elements"
  op: "Const"
  device: "/device:CPU:0"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_INT64
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT64
        tensor_shape {
        }
        int64_val: 2
      }
    }
  }
}
node {
  name: "prefetch_input_elements"
  op: "Const"
  device: "/device:CPU:0"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_INT64
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT64
        tensor_shape {
        }
        int64_val: 8
      }
    }
  }
}
node {
  name: "ExperimentalParallelInterleaveDataset"
  op: "ExperimentalParallelInterleaveDataset"
  input: "ShuffleDataset"
  input: "cycle_length"
  input: "block_length"
  input: "sloppy"
  input: "buffer_output_elements"
  input: "prefetch_input_elements"
  device: "/device:CPU:0"
  attr {
    key: "Targuments"
    value {
      list {
      }
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
  attr {
    key: "f"
    value {
      func {
        name: "__inference_tf_data_experimental_parallel_interleave_<class \'abc.ABCMeta\'>_40"
      }
    }
  }
  attr {
    key: "output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
  attr {
    key: "output_types"
    value {
      list {
        type: DT_STRING
      }
    }
  }
}
node {
  name: "buffer_size_1"
  op: "Const"
  device: "/device:CPU:0"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_INT64
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT64
        tensor_shape {
        }
        int64_val: 10000
      }
    }
  }
}
node {
  name: "count"
  op: "Const"
  device: "/device:CPU:0"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_INT64
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT64
        tensor_shape {
        }
        int64_val: -1
      }
    }
  }
}
node {
  name: "seed_1"
  op: "Const"
  device: "/device:CPU:0"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_INT64
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT64
        tensor_shape {
        }
        int64_val: 0
      }
    }
  }
}
node {
  name: "seed2_1"
  op: "Const"
  device: "/device:CPU:0"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_INT64
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT64
        tensor_shape {
        }
        int64_val: 0
      }
    }
  }
}
node {
  name: "ShuffleAndRepeatDataset"
  op: "ShuffleAndRepeatDataset"
  input: "ExperimentalParallelInterleaveDataset"
  input: "buffer_size_1"
  input: "seed_1"
  input: "seed2_1"
  input: "count"
  device: "/device:CPU:0"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
  attr {
    key: "output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
  attr {
    key: "output_types"
    value {
      list {
        type: DT_STRING
      }
    }
  }
}
node {
  name: "num_parallel_calls"
  op: "Const"
  device: "/device:CPU:0"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
        }
        int_val: 2
      }
    }
  }
}
node {
  name: "ParallelMapDataset"
  op: "ParallelMapDataset"
  input: "ShuffleAndRepeatDataset"
  input: "num_parallel_calls"
  device: "/device:CPU:0"
  attr {
    key: "Targuments"
    value {
      list {
      }
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
  attr {
    key: "f"
    value {
      func {
        name: "__inference_Dataset_map_<lambda>_99"
      }
    }
  }
  attr {
    key: "output_shapes"
    value {
      list {
        shape {
          dim {
            size: -1
          }
        }
        shape {
          dim {
            size: -1
          }
        }
        shape {
        }
        shape {
        }
        shape {
        }
        shape {
          dim {
            size: -1
          }
        }
        shape {
          dim {
            size: -1
          }
        }
        shape {
          dim {
            size: -1
          }
        }
        shape {
          dim {
            size: -1
          }
        }
      }
    }
  }
  attr {
    key: "output_types"
    value {
      list {
        type: DT_FLOAT
        type: DT_INT64
        type: DT_INT64
        type: DT_INT64
        type: DT_INT64
        type: DT_INT64
        type: DT_INT64
        type: DT_FLOAT
        type: DT_FLOAT
      }
    }
  }
  attr {
    key: "preserve_cardinality"
    value {
      b: false
    }
  }
  attr {
    key: "sloppy"
    value {
      b: false
    }
  }
  attr {
    key: "use_inter_op_parallelism"
    value {
      b: true
    }
  }
}
node {
  name: "buffer_size_2"
  op: "Const"
  device: "/device:CPU:0"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_INT64
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT64
        tensor_shape {
        }
        int64_val: 10
      }
    }
  }
}
node {
  name: "PrefetchDataset"
  op: "PrefetchDataset"
  input: "ParallelMapDataset"
  input: "buffer_size_2"
  device: "/device:CPU:0"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
  attr {
    key: "output_shapes"
    value {
      list {
        shape {
          dim {
            size: -1
          }
        }
        shape {
          dim {
            size: -1
          }
        }
        shape {
        }
        shape {
        }
        shape {
        }
        shape {
          dim {
            size: -1
          }
        }
        shape {
          dim {
            size: -1
          }
        }
        shape {
          dim {
            size: -1
          }
        }
        shape {
          dim {
            size: -1
          }
        }
      }
    }
  }
  attr {
    key: "output_types"
    value {
      list {
        type: DT_FLOAT
        type: DT_INT64
        type: DT_INT64
        type: DT_INT64
        type: DT_INT64
        type: DT_INT64
        type: DT_INT64
        type: DT_FLOAT
        type: DT_FLOAT
      }
    }
  }
  attr {
    key: "slack_period"
    value {
      i: 0
    }
  }
}
node {
  name: "OneShotIterator"
  op: "OneShotIterator"
  device: "/device:CPU:0"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "dataset_factory"
    value {
      func {
        name: "_make_dataset_lBp6ShTBAu8"
      }
    }
  }
  attr {
    key: "output_shapes"
    value {
      list {
        shape {
          dim {
            size: -1
          }
        }
        shape {
          dim {
            size: -1
          }
        }
        shape {
        }
        shape {
        }
        shape {
        }
        shape {
          dim {
            size: -1
          }
        }
        shape {
          dim {
            size: -1
          }
        }
        shape {
          dim {
            size: -1
          }
        }
        shape {
          dim {
            size: -1
          }
        }
      }
    }
  }
  attr {
    key: "output_types"
    value {
      list {
        type: DT_FLOAT
        type: DT_INT64
        type: DT_INT64
        type: DT_INT64
        type: DT_INT64
        type: DT_INT64
        type: DT_INT64
        type: DT_FLOAT
        type: DT_FLOAT
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: ""
    }
  }
}
node {
  name: "IteratorToStringHandle"
  op: "IteratorToStringHandle"
  input: "OneShotIterator"
  device: "/device:CPU:0"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
}
node {
  name: "transformation_func/IteratorGetNext"
  op: "IteratorGetNext"
  input: "OneShotIterator"
  device: "/device:CPU:0"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: -1
          }
        }
        shape {
          dim {
            size: -1
          }
        }
        shape {
        }
        shape {
        }
        shape {
        }
        shape {
          dim {
            size: -1
          }
        }
        shape {
          dim {
            size: -1
          }
        }
        shape {
          dim {
            size: -1
          }
        }
        shape {
          dim {
            size: -1
          }
        }
      }
    }
  }
  attr {
    key: "output_shapes"
    value {
      list {
        shape {
          dim {
            size: -1
          }
        }
        shape {
          dim {
            size: -1
          }
        }
        shape {
        }
        shape {
        }
        shape {
        }
        shape {
          dim {
            size: -1
          }
        }
        shape {
          dim {
            size: -1
          }
        }
        shape {
          dim {
            size: -1
          }
        }
        shape {
          dim {
            size: -1
          }
        }
      }
    }
  }
  attr {
    key: "output_types"
    value {
      list {
        type: DT_FLOAT
        type: DT_INT64
        type: DT_INT64
        type: DT_INT64
        type: DT_INT64
        type: DT_INT64
        type: DT_INT64
        type: DT_FLOAT
        type: DT_FLOAT
      }
    }
  }
}
node {
  name: "transformation_func/IteratorGetNext_1"
  op: "IteratorGetNext"
  input: "OneShotIterator"
  device: "/device:CPU:0"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: -1
          }
        }
        shape {
          dim {
            size: -1
          }
        }
        shape {
        }
        shape {
        }
        shape {
        }
        shape {
          dim {
            size: -1
          }
        }
        shape {
          dim {
            size: -1
          }
        }
        shape {
          dim {
            size: -1
          }
        }
        shape {
          dim {
            size: -1
          }
        }
      }
    }
  }
  attr {
    key: "output_shapes"
    value {
      list {
        shape {
          dim {
            size: -1
          }
        }
        shape {
          dim {
            size: -1
          }
        }
        shape {
        }
        shape {
        }
        shape {
        }
        shape {
          dim {
            size: -1
          }
        }
        shape {
          dim {
            size: -1
          }
        }
        shape {
          dim {
            size: -1
          }
        }
        shape {
          dim {
            size: -1
          }
        }
      }
    }
  }
  attr {
    key: "output_types"
    value {
      list {
        type: DT_FLOAT
        type: DT_INT64
        type: DT_INT64
        type: DT_INT64
        type: DT_INT64
        type: DT_INT64
        type: DT_INT64
        type: DT_FLOAT
        type: DT_FLOAT
      }
    }
  }
}
node {
  name: "transformation_func/IteratorGetNext_2"
  op: "IteratorGetNext"
  input: "OneShotIterator"
  device: "/device:CPU:0"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: -1
          }
        }
        shape {
          dim {
            size: -1
          }
        }
        shape {
        }
        shape {
        }
        shape {
        }
        shape {
          dim {
            size: -1
          }
        }
        shape {
          dim {
            size: -1
          }
        }
        shape {
          dim {
            size: -1
          }
        }
        shape {
          dim {
            size: -1
          }
        }
      }
    }
  }
  attr {
    key: "output_shapes"
    value {
      list {
        shape {
          dim {
            size: -1
          }
        }
        shape {
          dim {
            size: -1
          }
        }
        shape {
        }
        shape {
        }
        shape {
        }
        shape {
          dim {
            size: -1
          }
        }
        shape {
          dim {
            size: -1
          }
        }
        shape {
          dim {
            size: -1
          }
        }
        shape {
          dim {
            size: -1
          }
        }
      }
    }
  }
  attr {
    key: "output_types"
    value {
      list {
        type: DT_FLOAT
        type: DT_INT64
        type: DT_INT64
        type: DT_INT64
        type: DT_INT64
        type: DT_INT64
        type: DT_INT64
        type: DT_FLOAT
        type: DT_FLOAT
      }
    }
  }
}
node {
  name: "transformation_func/IteratorGetNext_3"
  op: "IteratorGetNext"
  input: "OneShotIterator"
  device: "/device:CPU:0"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: -1
          }
        }
        shape {
          dim {
            size: -1
          }
        }
        shape {
        }
        shape {
        }
        shape {
        }
        shape {
          dim {
            size: -1
          }
        }
        shape {
          dim {
            size: -1
          }
        }
        shape {
          dim {
            size: -1
          }
        }
        shape {
          dim {
            size: -1
          }
        }
      }
    }
  }
  attr {
    key: "output_shapes"
    value {
      list {
        shape {
          dim {
            size: -1
          }
        }
        shape {
          dim {
            size: -1
          }
        }
        shape {
        }
        shape {
        }
        shape {
        }
        shape {
          dim {
            size: -1
          }
        }
        shape {
          dim {
            size: -1
          }
        }
        shape {
          dim {
            size: -1
          }
        }
        shape {
          dim {
            size: -1
          }
        }
      }
    }
  }
  attr {
    key: "output_types"
    value {
      list {
        type: DT_FLOAT
        type: DT_INT64
        type: DT_INT64
        type: DT_INT64
        type: DT_INT64
        type: DT_INT64
        type: DT_INT64
        type: DT_FLOAT
        type: DT_FLOAT
      }
    }
  }
}
node {
  name: "transformation_func/IteratorGetNext_4"
  op: "IteratorGetNext"
  input: "OneShotIterator"
  device: "/device:CPU:0"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: -1
          }
        }
        shape {
          dim {
            size: -1
          }
        }
        shape {
        }
        shape {
        }
        shape {
        }
        shape {
          dim {
            size: -1
          }
        }
        shape {
          dim {
            size: -1
          }
        }
        shape {
          dim {
            size: -1
          }
        }
        shape {
          dim {
            size: -1
          }
        }
      }
    }
  }
  attr {
    key: "output_shapes"
    value {
      list {
        shape {
          dim {
            size: -1
          }
        }
        shape {
          dim {
            size: -1
          }
        }
        shape {
        }
        shape {
        }
        shape {
        }
        shape {
          dim {
            size: -1
          }
        }
        shape {
          dim {
            size: -1
          }
        }
        shape {
          dim {
            size: -1
          }
        }
        shape {
          dim {
            size: -1
          }
        }
      }
    }
  }
  attr {
    key: "output_types"
    value {
      list {
        type: DT_FLOAT
        type: DT_INT64
        type: DT_INT64
        type: DT_INT64
        type: DT_INT64
        type: DT_INT64
        type: DT_INT64
        type: DT_FLOAT
        type: DT_FLOAT
      }
    }
  }
}
node {
  name: "transformation_func/IteratorGetNext_5"
  op: "IteratorGetNext"
  input: "OneShotIterator"
  device: "/device:CPU:0"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: -1
          }
        }
        shape {
          dim {
            size: -1
          }
        }
        shape {
        }
        shape {
        }
        shape {
        }
        shape {
          dim {
            size: -1
          }
        }
        shape {
          dim {
            size: -1
          }
        }
        shape {
          dim {
            size: -1
          }
        }
        shape {
          dim {
            size: -1
          }
        }
      }
    }
  }
  attr {
    key: "output_shapes"
    value {
      list {
        shape {
          dim {
            size: -1
          }
        }
        shape {
          dim {
            size: -1
          }
        }
        shape {
        }
        shape {
        }
        shape {
        }
        shape {
          dim {
            size: -1
          }
        }
        shape {
          dim {
            size: -1
          }
        }
        shape {
          dim {
            size: -1
          }
        }
        shape {
          dim {
            size: -1
          }
        }
      }
    }
  }
  attr {
    key: "output_types"
    value {
      list {
        type: DT_FLOAT
        type: DT_INT64
        type: DT_INT64
        type: DT_INT64
        type: DT_INT64
        type: DT_INT64
        type: DT_INT64
        type: DT_FLOAT
        type: DT_FLOAT
      }
    }
  }
}
node {
  name: "transformation_func/IteratorGetNext_6"
  op: "IteratorGetNext"
  input: "OneShotIterator"
  device: "/device:CPU:0"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: -1
          }
        }
        shape {
          dim {
            size: -1
          }
        }
        shape {
        }
        shape {
        }
        shape {
        }
        shape {
          dim {
            size: -1
          }
        }
        shape {
          dim {
            size: -1
          }
        }
        shape {
          dim {
            size: -1
          }
        }
        shape {
          dim {
            size: -1
          }
        }
      }
    }
  }
  attr {
    key: "output_shapes"
    value {
      list {
        shape {
          dim {
            size: -1
          }
        }
        shape {
          dim {
            size: -1
          }
        }
        shape {
        }
        shape {
        }
        shape {
        }
        shape {
          dim {
            size: -1
          }
        }
        shape {
          dim {
            size: -1
          }
        }
        shape {
          dim {
            size: -1
          }
        }
        shape {
          dim {
            size: -1
          }
        }
      }
    }
  }
  attr {
    key: "output_types"
    value {
      list {
        type: DT_FLOAT
        type: DT_INT64
        type: DT_INT64
        type: DT_INT64
        type: DT_INT64
