node {
  name: "global_step/Initializer/zeros"
  op: "Const"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@global_step"
      }
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_INT64
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT64
        tensor_shape {
        }
        int64_val: 0
      }
    }
  }
}
node {
  name: "global_step"
  op: "VariableV2"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@global_step"
      }
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_INT64
    }
  }
  attr {
    key: "shape"
    value {
      shape {
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: ""
    }
  }
}
node {
  name: "global_step/Assign"
  op: "Assign"
  input: "global_step"
  input: "global_step/Initializer/zeros"
  attr {
    key: "T"
    value {
      type: DT_INT64
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@global_step"
      }
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
  attr {
    key: "use_locking"
    value {
      b: true
    }
  }
  attr {
    key: "validate_shape"
    value {
      b: true
    }
  }
}
node {
  name: "global_step/read"
  op: "Identity"
  input: "global_step"
  attr {
    key: "T"
    value {
      type: DT_INT64
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@global_step"
      }
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
}
node {
  name: "global_step/IsVariableInitialized"
  op: "IsVariableInitialized"
  input: "global_step"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@global_step"
      }
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_INT64
    }
  }
}
node {
  name: "global_step/cond/Switch"
  op: "Switch"
  input: "global_step/IsVariableInitialized"
  input: "global_step/IsVariableInitialized"
  attr {
    key: "T"
    value {
      type: DT_BOOL
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
        shape {
        }
      }
    }
  }
}
node {
  name: "global_step/cond/switch_t"
  op: "Identity"
  input: "global_step/cond/Switch:1"
  attr {
    key: "T"
    value {
      type: DT_BOOL
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
}
node {
  name: "global_step/cond/switch_f"
  op: "Identity"
  input: "global_step/cond/Switch"
  attr {
    key: "T"
    value {
      type: DT_BOOL
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
}
node {
  name: "global_step/cond/pred_id"
  op: "Identity"
  input: "global_step/IsVariableInitialized"
  attr {
    key: "T"
    value {
      type: DT_BOOL
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
}
node {
  name: "global_step/cond/read"
  op: "Identity"
  input: "global_step/cond/read/Switch:1"
  attr {
    key: "T"
    value {
      type: DT_INT64
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
}
node {
  name: "global_step/cond/read/Switch"
  op: "RefSwitch"
  input: "global_step"
  input: "global_step/cond/pred_id"
  attr {
    key: "T"
    value {
      type: DT_INT64
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@global_step"
      }
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
        shape {
        }
      }
    }
  }
}
node {
  name: "global_step/cond/Switch_1"
  op: "Switch"
  input: "global_step/Initializer/zeros"
  input: "global_step/cond/pred_id"
  attr {
    key: "T"
    value {
      type: DT_INT64
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@global_step"
      }
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
        shape {
        }
      }
    }
  }
}
node {
  name: "global_step/cond/Merge"
  op: "Merge"
  input: "global_step/cond/Switch_1"
  input: "global_step/cond/read"
  attr {
    key: "N"
    value {
      i: 2
    }
  }
  attr {
    key: "T"
    value {
      type: DT_INT64
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
        shape {
        }
      }
    }
  }
}
node {
  name: "global_step/add/y"
  op: "Const"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_INT64
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT64
        tensor_shape {
        }
        int64_val: 0
      }
    }
  }
}
node {
  name: "global_step/add"
  op: "Add"
  input: "global_step/cond/Merge"
  input: "global_step/add/y"
  attr {
    key: "T"
    value {
      type: DT_INT64
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
}
node {
  name: "tensors/normalize_tensors/component_0"
  op: "Const"
  device: "/device:CPU:0"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 2951
          }
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_STRING
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_STRING
        tensor_shape {
          dim {
            size: 2951
          }
        }
        string_val: "topology/tfrecords/train_2ms/1000.tfrecords"
        string_val: "topology/tfrecords/train_2ms/1001.tfrecords"
        string_val: "topology/tfrecords/train_2ms/1002.tfrecords"
        string_val: "topology/tfrecords/train_2ms/1003.tfrecords"
        string_val: "topology/tfrecords/train_2ms/1004.tfrecords"
        string_val: "topology/tfrecords/train_2ms/1006.tfrecords"
        string_val: "topology/tfrecords/train_2ms/1007.tfrecords"
        string_val: "topology/tfrecords/train_2ms/100.tfrecords"
        string_val: "topology/tfrecords/train_2ms/1010.tfrecords"
        string_val: "topology/tfrecords/train_2ms/1013.tfrecords"
        string_val: "topology/tfrecords/train_2ms/1014.tfrecords"
        string_val: "topology/tfrecords/train_2ms/1015.tfrecords"
        string_val: "topology/tfrecords/train_2ms/1016.tfrecords"
        string_val: "topology/tfrecords/train_2ms/1017.tfrecords"
        string_val: "topology/tfrecords/train_2ms/1018.tfrecords"
        string_val: "topology/tfrecords/train_2ms/1019.tfrecords"
        string_val: "topology/tfrecords/train_2ms/1020.tfrecords"
        string_val: "topology/tfrecords/train_2ms/1021.tfrecords"
        string_val: "topology/tfrecords/train_2ms/1023.tfrecords"
        string_val: "topology/tfrecords/train_2ms/1024.tfrecords"
        string_val: "topology/tfrecords/train_2ms/1025.tfrecords"
        string_val: "topology/tfrecords/train_2ms/1028.tfrecords"
        string_val: "topology/tfrecords/train_2ms/1029.tfrecords"
        string_val: "topology/tfrecords/train_2ms/102.tfrecords"
        string_val: "topology/tfrecords/train_2ms/1030.tfrecords"
        string_val: "topology/tfrecords/train_2ms/1031.tfrecords"
        string_val: "topology/tfrecords/train_2ms/1032.tfrecords"
        string_val: "topology/tfrecords/train_2ms/1033.tfrecords"
        string_val: "topology/tfrecords/train_2ms/1034.tfrecords"
        string_val: "topology/tfrecords/train_2ms/1035.tfrecords"
        string_val: "topology/tfrecords/train_2ms/1036.tfrecords"
        string_val: "topology/tfrecords/train_2ms/1037.tfrecords"
        string_val: "topology/tfrecords/train_2ms/1038.tfrecords"
        string_val: "topology/tfrecords/train_2ms/1039.tfrecords"
        string_val: "topology/tfrecords/train_2ms/103.tfrecords"
        string_val: "topology/tfrecords/train_2ms/1043.tfrecords"
        string_val: "topology/tfrecords/train_2ms/1044.tfrecords"
        string_val: "topology/tfrecords/train_2ms/1045.tfrecords"
        string_val: "topology/tfrecords/train_2ms/1046.tfrecords"
        string_val: "topology/tfrecords/train_2ms/1047.tfrecords"
        string_val: "topology/tfrecords/train_2ms/1048.tfrecords"
        string_val: "topology/tfrecords/train_2ms/1049.tfrecords"
        string_val: "topology/tfrecords/train_2ms/104.tfrecords"
        string_val: "topology/tfrecords/train_2ms/1051.tfrecords"
        string_val: "topology/tfrecords/train_2ms/1052.tfrecords"
        string_val: "topology/tfrecords/train_2ms/1053.tfrecords"
        string_val: "topology/tfrecords/train_2ms/1054.tfrecords"
        string_val: "topology/tfrecords/train_2ms/1055.tfrecords"
        string_val: "topology/tfrecords/train_2ms/1056.tfrecords"
        string_val: "topology/tfrecords/train_2ms/1057.tfrecords"
        string_val: "topology/tfrecords/train_2ms/1058.tfrecords"
        string_val: "topology/tfrecords/train_2ms/1059.tfrecords"
        string_val: "topology/tfrecords/train_2ms/105.tfrecords"
        string_val: "topology/tfrecords/train_2ms/1061.tfrecords"
        string_val: "topology/tfrecords/train_2ms/1062.tfrecords"
        string_val: "topology/tfrecords/train_2ms/1064.tfrecords"
        string_val: "topology/tfrecords/train_2ms/1065.tfrecords"
        string_val: "topology/tfrecords/train_2ms/1068.tfrecords"
        string_val: "topology/tfrecords/train_2ms/1069.tfrecords"
        string_val: "topology/tfrecords/train_2ms/106.tfrecords"
        string_val: "topology/tfrecords/train_2ms/1071.tfrecords"
        string_val: "topology/tfrecords/train_2ms/1072.tfrecords"
        string_val: "topology/tfrecords/train_2ms/1074.tfrecords"
        string_val: "topology/tfrecords/train_2ms/1075.tfrecords"
        string_val: "topology/tfrecords/train_2ms/1076.tfrecords"
        string_val: "topology/tfrecords/train_2ms/1077.tfrecords"
        string_val: "topology/tfrecords/train_2ms/1078.tfrecords"
        string_val: "topology/tfrecords/train_2ms/1079.tfrecords"
        string_val: "topology/tfrecords/train_2ms/107.tfrecords"
        string_val: "topology/tfrecords/train_2ms/1080.tfrecords"
        string_val: "topology/tfrecords/train_2ms/1081.tfrecords"
        string_val: "topology/tfrecords/train_2ms/1082.tfrecords"
        string_val: "topology/tfrecords/train_2ms/1083.tfrecords"
        string_val: "topology/tfrecords/train_2ms/1084.tfrecords"
        string_val: "topology/tfrecords/train_2ms/1086.tfrecords"
        string_val: "topology/tfrecords/train_2ms/1087.tfrecords"
        string_val: "topology/tfrecords/train_2ms/108.tfrecords"
        string_val: "topology/tfrecords/train_2ms/1090.tfrecords"
        string_val: "topology/tfrecords/train_2ms/1091.tfrecords"
        string_val: "topology/tfrecords/train_2ms/1092.tfrecords"
        string_val: "topology/tfrecords/train_2ms/1093.tfrecords"
        string_val: "topology/tfrecords/train_2ms/1094.tfrecords"
        string_val: "topology/tfrecords/train_2ms/1096.tfrecords"
        string_val: "topology/tfrecords/train_2ms/1097.tfrecords"
        string_val: "topology/tfrecords/train_2ms/1098.tfrecords"
        string_val: "topology/tfrecords/train_2ms/109.tfrecords"
        string_val: "topology/tfrecords/train_2ms/10.tfrecords"
        string_val: "topology/tfrecords/train_2ms/1100.tfrecords"
        string_val: "topology/tfrecords/train_2ms/1102.tfrecords"
        string_val: "topology/tfrecords/train_2ms/1103.tfrecords"
        string_val: "topology/tfrecords/train_2ms/1105.tfrecords"
        string_val: "topology/tfrecords/train_2ms/1107.tfrecords"
        string_val: "topology/tfrecords/train_2ms/1108.tfrecords"
        string_val: "topology/tfrecords/train_2ms/1109.tfrecords"
        string_val: "topology/tfrecords/train_2ms/110.tfrecords"
        string_val: "topology/tfrecords/train_2ms/1112.tfrecords"
        string_val: "topology/tfrecords/train_2ms/1114.tfrecords"
        string_val: "topology/tfrecords/train_2ms/1115.tfrecords"
        string_val: "topology/tfrecords/train_2ms/1116.tfrecords"
        string_val: "topology/tfrecords/train_2ms/1117.tfrecords"
        string_val: "topology/tfrecords/train_2ms/1118.tfrecords"
        string_val: "topology/tfrecords/train_2ms/111.tfrecords"
        string_val: "topology/tfrecords/train_2ms/1120.tfrecords"
        string_val: "topology/tfrecords/train_2ms/1121.tfrecords"
        string_val: "topology/tfrecords/train_2ms/1122.tfrecords"
        string_val: "topology/tfrecords/train_2ms/1124.tfrecords"
        string_val: "topology/tfrecords/train_2ms/1125.tfrecords"
        string_val: "topology/tfrecords/train_2ms/1126.tfrecords"
        string_val: "topology/tfrecords/train_2ms/1127.tfrecords"
        string_val: "topology/tfrecords/train_2ms/1128.tfrecords"
        string_val: "topology/tfrecords/train_2ms/1129.tfrecords"
        string_val: "topology/tfrecords/train_2ms/112.tfrecords"
        string_val: "topology/tfrecords/train_2ms/1130.tfrecords"
        string_val: "topology/tfrecords/train_2ms/1134.tfrecords"
        string_val: "topology/tfrecords/train_2ms/1135.tfrecords"
        string_val: "topology/tfrecords/train_2ms/1136.tfrecords"
        string_val: "topology/tfrecords/train_2ms/1137.tfrecords"
        string_val: "topology/tfrecords/train_2ms/1138.tfrecords"
        string_val: "topology/tfrecords/train_2ms/1139.tfrecords"
        string_val: "topology/tfrecords/train_2ms/113.tfrecords"
        string_val: "topology/tfrecords/train_2ms/1140.tfrecords"
        string_val: "topology/tfrecords/train_2ms/1141.tfrecords"
        string_val: "topology/tfrecords/train_2ms/1143.tfrecords"
        string_val: "topology/tfrecords/train_2ms/1144.tfrecords"
        string_val: "topology/tfrecords/train_2ms/1145.tfrecords"
        string_val: "topology/tfrecords/train_2ms/1146.tfrecords"
        string_val: "topology/tfrecords/train_2ms/1147.tfrecords"
        string_val: "topology/tfrecords/train_2ms/1148.tfrecords"
        string_val: "topology/tfrecords/train_2ms/1149.tfrecords"
        string_val: "topology/tfrecords/train_2ms/114.tfrecords"
        string_val: "topology/tfrecords/train_2ms/1150.tfrecords"
        string_val: "topology/tfrecords/train_2ms/1151.tfrecords"
        string_val: "topology/tfrecords/train_2ms/1152.tfrecords"
        string_val: "topology/tfrecords/train_2ms/1153.tfrecords"
        string_val: "topology/tfrecords/train_2ms/1154.tfrecords"
        string_val: "topology/tfrecords/train_2ms/1155.tfrecords"
        string_val: "topology/tfrecords/train_2ms/1156.tfrecords"
        string_val: "topology/tfrecords/train_2ms/1157.tfrecords"
        string_val: "topology/tfrecords/train_2ms/1158.tfrecords"
        string_val: "topology/tfrecords/train_2ms/1159.tfrecords"
        string_val: "topology/tfrecords/train_2ms/115.tfrecords"
        string_val: "topology/tfrecords/train_2ms/1160.tfrecords"
        string_val: "topology/tfrecords/train_2ms/1161.tfrecords"
        string_val: "topology/tfrecords/train_2ms/1163.tfrecords"
        string_val: "topology/tfrecords/train_2ms/1164.tfrecords"
        string_val: "topology/tfrecords/train_2ms/1165.tfrecords"
        string_val: "topology/tfrecords/train_2ms/1166.tfrecords"
        string_val: "topology/tfrecords/train_2ms/1167.tfrecords"
        string_val: "topology/tfrecords/train_2ms/1168.tfrecords"
        string_val: "topology/tfrecords/train_2ms/1169.tfrecords"
        string_val: "topology/tfrecords/train_2ms/116.tfrecords"
        string_val: "topology/tfrecords/train_2ms/1170.tfrecords"
        string_val: "topology/tfrecords/train_2ms/1171.tfrecords"
        string_val: "topology/tfrecords/train_2ms/1172.tfrecords"
        string_val: "topology/tfrecords/train_2ms/1173.tfrecords"
        string_val: "topology/tfrecords/train_2ms/1174.tfrecords"
        string_val: "topology/tfrecords/train_2ms/1175.tfrecords"
        string_val: "topology/tfrecords/train_2ms/1176.tfrecords"
        string_val: "topology/tfrecords/train_2ms/1177.tfrecords"
        string_val: "topology/tfrecords/train_2ms/117.tfrecords"
        string_val: "topology/tfrecords/train_2ms/1180.tfrecords"
        string_val: "topology/tfrecords/train_2ms/1181.tfrecords"
        string_val: "topology/tfrecords/train_2ms/1182.tfrecords"
        string_val: "topology/tfrecords/train_2ms/1185.tfrecords"
        string_val: "topology/tfrecords/train_2ms/1186.tfrecords"
        string_val: "topology/tfrecords/train_2ms/1187.tfrecords"
        string_val: "topology/tfrecords/train_2ms/1189.tfrecords"
        string_val: "topology/tfrecords/train_2ms/118.tfrecords"
        string_val: "topology/tfrecords/train_2ms/1190.tfrecords"
        string_val: "topology/tfrecords/train_2ms/1191.tfrecords"
        string_val: "topology/tfrecords/train_2ms/1193.tfrecords"
        string_val: "topology/tfrecords/train_2ms/1194.tfrecords"
        string_val: "topology/tfrecords/train_2ms/1195.tfrecords"
        string_val: "topology/tfrecords/train_2ms/1197.tfrecords"
        string_val: "topology/tfrecords/train_2ms/1198.tfrecords"
        string_val: "topology/tfrecords/train_2ms/1199.tfrecords"
        string_val: "topology/tfrecords/train_2ms/119.tfrecords"
        string_val: "topology/tfrecords/train_2ms/11.tfrecords"
        string_val: "topology/tfrecords/train_2ms/1200.tfrecords"
        string_val: "topology/tfrecords/train_2ms/1201.tfrecords"
        string_val: "topology/tfrecords/train_2ms/1202.tfrecords"
        string_val: "topology/tfrecords/train_2ms/1203.tfrecords"
        string_val: "topology/tfrecords/train_2ms/1204.tfrecords"
        string_val: "topology/tfrecords/train_2ms/1206.tfrecords"
        string_val: "topology/tfrecords/train_2ms/1207.tfrecords"
        string_val: "topology/tfrecords/train_2ms/1209.tfrecords"
        string_val: "topology/tfrecords/train_2ms/120.tfrecords"
        string_val: "topology/tfrecords/train_2ms/1210.tfrecords"
        string_val: "topology/tfrecords/train_2ms/1211.tfrecords"
        string_val: "topology/tfrecords/train_2ms/1212.tfrecords"
        string_val: "topology/tfrecords/train_2ms/1213.tfrecords"
        string_val: "topology/tfrecords/train_2ms/1214.tfrecords"
        string_val: "topology/tfrecords/train_2ms/1215.tfrecords"
        string_val: "topology/tfrecords/train_2ms/1216.tfrecords"
        string_val: "topology/tfrecords/train_2ms/1218.tfrecords"
        string_val: "topology/tfrecords/train_2ms/1219.tfrecords"
        string_val: "topology/tfrecords/train_2ms/121.tfrecords"
        string_val: "topology/tfrecords/train_2ms/1220.tfrecords"
        string_val: "topology/tfrecords/train_2ms/1221.tfrecords"
        string_val: "topology/tfrecords/train_2ms/1222.tfrecords"
        string_val: "topology/tfrecords/train_2ms/1223.tfrecords"
        string_val: "topology/tfrecords/train_2ms/1224.tfrecords"
        string_val: "topology/tfrecords/train_2ms/1225.tfrecords"
        string_val: "topology/tfrecords/train_2ms/1226.tfrecords"
        string_val: "topology/tfrecords/train_2ms/1227.tfrecords"
        string_val: "topology/tfrecords/train_2ms/1228.tfrecords"
        string_val: "topology/tfrecords/train_2ms/1229.tfrecords"
        string_val: "topology/tfrecords/train_2ms/122.tfrecords"
        string_val: "topology/tfrecords/train_2ms/1232.tfrecords"
        string_val: "topology/tfrecords/train_2ms/1233.tfrecords"
        string_val: "topology/tfrecords/train_2ms/1234.tfrecords"
        string_val: "topology/tfrecords/train_2ms/1235.tfrecords"
        string_val: "topology/tfrecords/train_2ms/1236.tfrecords"
        string_val: "topology/tfrecords/train_2ms/1238.tfrecords"
        string_val: "topology/tfrecords/train_2ms/1239.tfrecords"
        string_val: "topology/tfrecords/train_2ms/123.tfrecords"
        string_val: "topology/tfrecords/train_2ms/1240.tfrecords"
        string_val: "topology/tfrecords/train_2ms/1241.tfrecords"
        string_val: "topology/tfrecords/train_2ms/1242.tfrecords"
        string_val: "topology/tfrecords/train_2ms/1247.tfrecords"
        string_val: "topology/tfrecords/train_2ms/1249.tfrecords"
        string_val: "topology/tfrecords/train_2ms/1250.tfrecords"
        string_val: "topology/tfrecords/train_2ms/1251.tfrecords"
        string_val: "topology/tfrecords/train_2ms/1252.tfrecords"
        string_val: "topology/tfrecords/train_2ms/1253.tfrecords"
        string_val: "topology/tfrecords/train_2ms/1255.tfrecords"
        string_val: "topology/tfrecords/train_2ms/1256.tfrecords"
        string_val: "topology/tfrecords/train_2ms/1257.tfrecords"
        string_val: "topology/tfrecords/train_2ms/1258.tfrecords"
        string_val: "topology/tfrecords/train_2ms/1259.tfrecords"
        string_val: "topology/tfrecords/train_2ms/125.tfrecords"
        string_val: "topology/tfrecords/train_2ms/1260.tfrecords"
        string_val: "topology/tfrecords/train_2ms/1261.tfrecords"
        string_val: "topology/tfrecords/train_2ms/1263.tfrecords"
        string_val: "topology/tfrecords/train_2ms/1264.tfrecords"
        string_val: "topology/tfrecords/train_2ms/1266.tfrecords"
        string_val: "topology/tfrecords/train_2ms/1267.tfrecords"
        string_val: "topology/tfrecords/train_2ms/1268.tfrecords"
        string_val: "topology/tfrecords/train_2ms/1269.tfrecords"
        string_val: "topology/tfrecords/train_2ms/1270.tfrecords"
        string_val: "topology/tfrecords/train_2ms/1271.tfrecords"
        string_val: "topology/tfrecords/train_2ms/1272.tfrecords"
        string_val: "topology/tfrecords/train_2ms/1273.tfrecords"
        string_val: "topology/tfrecords/train_2ms/1274.tfrecords"
        string_val: "topology/tfrecords/train_2ms/1275.tfrecords"
        string_val: "topology/tfrecords/train_2ms/1276.tfrecords"
        string_val: "topology/tfrecords/train_2ms/1277.tfrecords"
        string_val: "topology/tfrecords/train_2ms/1278.tfrecords"
        string_val: "topology/tfrecords/train_2ms/1279.tfrecords"
        string_val: "topology/tfrecords/train_2ms/127.tfrecords"
        string_val: "topology/tfrecords/train_2ms/1280.tfrecords"
        string_val: "topology/tfrecords/train_2ms/1281.tfrecords"
        string_val: "topology/tfrecords/train_2ms/1282.tfrecords"
        string_val: "topology/tfrecords/train_2ms/1283.tfrecords"
        string_val: "topology/tfrecords/train_2ms/1284.tfrecords"
        string_val: "topology/tfrecords/train_2ms/1285.tfrecords"
        string_val: "topology/tfrecords/train_2ms/1287.tfrecords"
        string_val: "topology/tfrecords/train_2ms/128.tfrecords"
        string_val: "topology/tfrecords/train_2ms/1290.tfrecords"
        string_val: "topology/tfrecords/train_2ms/1291.tfrecords"
        string_val: "topology/tfrecords/train_2ms/1293.tfrecords"
        string_val: "topology/tfrecords/train_2ms/1294.tfrecords"
        string_val: "topology/tfrecords/train_2ms/1295.tfrecords"
        string_val: "topology/tfrecords/train_2ms/1296.tfrecords"
        string_val: "topology/tfrecords/train_2ms/1297.tfrecords"
        string_val: "topology/tfrecords/train_2ms/1299.tfrecords"
        string_val: "topology/tfrecords/train_2ms/129.tfrecords"
        string_val: "topology/tfrecords/train_2ms/1300.tfrecords"
        string_val: "topology/tfrecords/train_2ms/1301.tfrecords"
        string_val: "topology/tfrecords/train_2ms/1302.tfrecords"
        string_val: "topology/tfrecords/train_2ms/1303.tfrecords"
        string_val: "topology/tfrecords/train_2ms/1304.tfrecords"
        string_val: "topology/tfrecords/train_2ms/1305.tfrecords"
        string_val: "topology/tfrecords/train_2ms/1306.tfrecords"
        string_val: "topology/tfrecords/train_2ms/1307.tfrecords"
        string_val: "topology/tfrecords/train_2ms/1308.tfrecords"
        string_val: "topology/tfrecords/train_2ms/1309.tfrecords"
        string_val: "topology/tfrecords/train_2ms/130.tfrecords"
        string_val: "topology/tfrecords/train_2ms/1310.tfrecords"
        string_val: "topology/tfrecords/train_2ms/1311.tfrecords"
        string_val: "topology/tfrecords/train_2ms/1312.tfrecords"
        string_val: "topology/tfrecords/train_2ms/1314.tfrecords"
        string_val: "topology/tfrecords/train_2ms/1317.tfrecords"
        string_val: "topology/tfrecords/train_2ms/1319.tfrecords"
        string_val: "topology/tfrecords/train_2ms/131.tfrecords"
        string_val: "topology/tfrecords/train_2ms/1320.tfrecords"
        string_val: "topology/tfrecords/train_2ms/1322.tfrecords"
        string_val: "topology/tfrecords/train_2ms/1323.tfrecords"
        string_val: "topology/tfrecords/train_2ms/1325.tfrecords"
        string_val: "topology/tfrecords/train_2ms/1327.tfrecords"
        string_val: "topology/tfrecords/train_2ms/1328.tfrecords"
        string_val: "topology/tfrecords/train_2ms/1329.tfrecords"
        string_val: "topology/tfrecords/train_2ms/132.tfrecords"
        string_val: "topology/tfrecords/train_2ms/1330.tfrecords"
        string_val: "topology/tfrecords/train_2ms/1331.tfrecords"
        string_val: "topology/tfrecords/train_2ms/1332.tfrecords"
        string_val: "topology/tfrecords/train_2ms/1333.tfrecords"
        string_val: "topology/tfrecords/train_2ms/1334.tfrecords"
        string_val: "topology/tfrecords/train_2ms/1336.tfrecords"
        string_val: "topology/tfrecords/train_2ms/1337.tfrecords"
        string_val: "topology/tfrecords/train_2ms/1338.tfrecords"
        string_val: "topology/tfrecords/train_2ms/1339.tfrecords"
        string_val: "topology/tfrecords/train_2ms/133.tfrecords"
        string_val: "topology/tfrecords/train_2ms/1340.tfrecords"
        string_val: "topology/tfrecords/train_2ms/1341.tfrecords"
        string_val: "topology/tfrecords/train_2ms/1342.tfrecords"
        string_val: "topology/tfrecords/train_2ms/1343.tfrecords"
        string_val: "topology/tfrecords/train_2ms/1344.tfrecords"
        string_val: "topology/tfrecords/train_2ms/1345.tfrecords"
        string_val: "topology/tfrecords/train_2ms/1346.tfrecords"
        string_val: "topology/tfrecords/train_2ms/1347.tfrecords"
        string_val: "topology/tfrecords/train_2ms/1348.tfrecords"
        string_val: "topology/tfrecords/train_2ms/1349.tfrecords"
        string_val: "topology/tfrecords/train_2ms/134.tfrecords"
        string_val: "topology/tfrecords/train_2ms/1350.tfrecords"
        string_val: "topology/tfrecords/train_2ms/1351.tfrecords"
        string_val: "topology/tfrecords/train_2ms/1352.tfrecords"
        string_val: "topology/tfrecords/train_2ms/1353.tfrecords"
        string_val: "topology/tfrecords/train_2ms/1354.tfrecords"
        string_val: "topology/tfrecords/train_2ms/1355.tfrecords"
        string_val: "topology/tfrecords/train_2ms/1357.tfrecords"
        string_val: "topology/tfrecords/train_2ms/135.tfrecords"
        string_val: "topology/tfrecords/train_2ms/1360.tfrecords"
        string_val: "topology/tfrecords/train_2ms/1361.tfrecords"
        string_val: "topology/tfrecords/train_2ms/1363.tfrecords"
        string_val: "topology/tfrecords/train_2ms/1364.tfrecords"
        string_val: "topology/tfrecords/train_2ms/1365.tfrecords"
        string_val: "topology/tfrecords/train_2ms/1366.tfrecords"
        string_val: "topology/tfrecords/train_2ms/1367.tfrecords"
        string_val: "topology/tfrecords/train_2ms/1369.tfrecords"
        string_val: "topology/tfrecords/train_2ms/136.tfrecords"
        string_val: "topology/tfrecords/train_2ms/1370.tfrecords"
        string_val: "topology/tfrecords/train_2ms/1371.tfrecords"
        string_val: "topology/tfrecords/train_2ms/1372.tfrecords"
        string_val: "topology/tfrecords/train_2ms/1374.tfrecords"
        string_val: "topology/tfrecords/train_2ms/1375.tfrecords"
        string_val: "topology/tfrecords/train_2ms/1376.tfrecords"
        string_val: "topology/tfrecords/train_2ms/1377.tfrecords"
        string_val: "topology/tfrecords/train_2ms/1378.tfrecords"
        string_val: "topology/tfrecords/train_2ms/1379.tfrecords"
        string_val: "topology/tfrecords/train_2ms/1380.tfrecords"
        string_val: "topology/tfrecords/train_2ms/1381.tfrecords"
        string_val: "topology/tfrecords/train_2ms/1382.tfrecords"
        string_val: "topology/tfrecords/train_2ms/1383.tfrecords"
        string_val: "topology/tfrecords/train_2ms/1384.tfrecords"
        string_val: "topology/tfrecords/train_2ms/1385.tfrecords"
        string_val: "topology/tfrecords/train_2ms/1387.tfrecords"
        string_val: "topology/tfrecords/train_2ms/1388.tfrecords"
        string_val: "topology/tfrecords/train_2ms/1389.tfrecords"
        string_val: "topology/tfrecords/train_2ms/138.tfrecords"
        string_val: "topology/tfrecords/train_2ms/1390.tfrecords"
        string_val: "topology/tfrecords/train_2ms/1391.tfrecords"
        string_val: "topology/tfrecords/train_2ms/1392.tfrecords"
        string_val: "topology/tfrecords/train_2ms/1393.tfrecords"
        string_val: "topology/tfrecords/train_2ms/1394.tfrecords"
        string_val: "topology/tfrecords/train_2ms/1396.tfrecords"
        string_val: "topology/tfrecords/train_2ms/1397.tfrecords"
        string_val: "topology/tfrecords/train_2ms/1398.tfrecords"
        string_val: "topology/tfrecords/train_2ms/1399.tfrecords"
        string_val: "topology/tfrecords/train_2ms/13.tfrecords"
        string_val: "topology/tfrecords/train_2ms/1400.tfrecords"
        string_val: "topology/tfrecords/train_2ms/1401.tfrecords"
        string_val: "topology/tfrecords/train_2ms/1402.tfrecords"
        string_val: "topology/tfrecords/train_2ms/1403.tfrecords"
        string_val: "topology/tfrecords/train_2ms/1404.tfrecords"
        string_val: "topology/tfrecords/train_2ms/1405.tfrecords"
        string_val: "topology/tfrecords/train_2ms/1406.tfrecords"
        string_val: "topology/tfrecords/train_2ms/1408.tfrecords"
        string_val: "topology/tfrecords/train_2ms/140.tfrecords"
        string_val: "topology/tfrecords/train_2ms/1410.tfrecords"
        string_val: "topology/tfrecords/train_2ms/1413.tfrecords"
        string_val: "topology/tfrecords/train_2ms/1414.tfrecords"
        string_val: "topology/tfrecords/train_2ms/1415.tfrecords"
        string_val: "topology/tfrecords/train_2ms/1417.tfrecords"
        string_val: "topology/tfrecords/train_2ms/1418.tfrecords"
        string_val: "topology/tfrecords/train_2ms/1419.tfrecords"
        string_val: "topology/tfrecords/train_2ms/141.tfrecords"
        string_val: "topology/tfrecords/train_2ms/1420.tfrecords"
        string_val: "topology/tfrecords/train_2ms/1421.tfrecords"
        string_val: "topology/tfrecords/train_2ms/1422.tfrecords"
        string_val: "topology/tfrecords/train_2ms/1426.tfrecords"
        string_val: "topology/tfrecords/train_2ms/1427.tfrecords"
        string_val: "topology/tfrecords/train_2ms/1428.tfrecords"
        string_val: "topology/tfrecords/train_2ms/142.tfrecords"
        string_val: "topology/tfrecords/train_2ms/1430.tfrecords"
        string_val: "topology/tfrecords/train_2ms/1431.tfrecords"
        string_val: "topology/tfrecords/train_2ms/1432.tfrecords"
        string_val: "topology/tfrecords/train_2ms/1433.tfrecords"
        string_val: "topology/tfrecords/train_2ms/1434.tfrecords"
        string_val: "topology/tfrecords/train_2ms/1435.tfrecords"
        string_val: "topology/tfrecords/train_2ms/1436.tfrecords"
        string_val: "topology/tfrecords/train_2ms/1437.tfrecords"
        string_val: "topology/tfrecords/train_2ms/1438.tfrecords"
        string_val: "topology/tfrecords/train_2ms/1439.tfrecords"
        string_val: "topology/tfrecords/train_2ms/143.tfrecords"
        string_val: "topology/tfrecords/train_2ms/1440.tfrecords"
        string_val: "topology/tfrecords/train_2ms/1441.tfrecords"
        string_val: "topology/tfrecords/train_2ms/1443.tfrecords"
        string_val: "topology/tfrecords/train_2ms/1444.tfrecords"
        string_val: "topology/tfrecords/train_2ms/1445.tfrecords"
        string_val: "topology/tfrecords/train_2ms/1447.tfrecords"
        string_val: "topology/tfrecords/train_2ms/1448.tfrecords"
        string_val: "topology/tfrecords/train_2ms/1449.tfrecords"
        string_val: "topology/tfrecords/train_2ms/1450.tfrecords"
        string_val: "topology/tfrecords/train_2ms/1452.tfrecords"
        string_val: "topology/tfrecords/train_2ms/1453.tfrecords"
        string_val: "topology/tfrecords/train_2ms/1455.tfrecords"
        string_val: "topology/tfrecords/train_2ms/1457.tfrecords"
        string_val: "topology/tfrecords/train_2ms/1458.tfrecords"
        string_val: "topology/tfrecords/train_2ms/1459.tfrecords"
        string_val: "topology/tfrecords/train_2ms/145.tfrecords"
        string_val: "topology/tfrecords/train_2ms/1461.tfrecords"
        string_val: "topology/tfrecords/train_2ms/1462.tfrecords"
        string_val: "topology/tfrecords/train_2ms/1463.tfrecords"
        string_val: "topology/tfrecords/train_2ms/1464.tfrecords"
        string_val: "topology/tfrecords/train_2ms/1465.tfrecords"
        string_val: "topology/tfrecords/train_2ms/1466.tfrecords"
        string_val: "topology/tfrecords/train_2ms/1467.tfrecords"
        string_val: "topology/tfrecords/train_2ms/1468.tfrecords"
        string_val: "topology/tfrecords/train_2ms/1469.tfrecords"
        string_val: "topology/tfrecords/train_2ms/146.tfrecords"
        string_val: "topology/tfrecords/train_2ms/1470.tfrecords"
        string_val: "topology/tfrecords/train_2ms/1471.tfrecords"
        string_val: "topology/tfrecords/train_2ms/1472.tfrecords"
        string_val: "topology/tfrecords/train_2ms/1473.tfrecords"
        string_val: "topology/tfrecords/train_2ms/1474.tfrecords"
        string_val: "topology/tfrecords/train_2ms/1475.tfrecords"
        string_val: "topology/tfrecords/train_2ms/1476.tfrecords"
        string_val: "topology/tfrecords/train_2ms/1477.tfrecords"
        string_val: "topology/tfrecords/train_2ms/1478.tfrecords"
        string_val: "topology/tfrecords/train_2ms/1479.tfrecords"
        string_val: "topology/tfrecords/train_2ms/147.tfrecords"
        string_val: "topology/tfrecords/train_2ms/1480.tfrecords"
        string_val: "topology/tfrecords/train_2ms/1481.tfrecords"
        string_val: "topology/tfrecords/train_2ms/1482.tfrecords"
        string_val: "topology/tfrecords/train_2ms/1483.tfrecords"
        string_val: "topology/tfrecords/train_2ms/1484.tfrecords"
        string_val: "topology/tfrecords/train_2ms/1485.tfrecords"
        string_val: "topology/tfrecords/train_2ms/1487.tfrecords"
        string_val: "topology/tfrecords/train_2ms/1488.tfrecords"
        string_val: "topology/tfrecords/train_2ms/1489.tfrecords"
        string_val: "topology/tfrecords/train_2ms/148.tfrecords"
        string_val: "topology/tfrecords/train_2ms/1490.tfrecords"
        string_val: "topology/tfrecords/train_2ms/1492.tfrecords"
        string_val: "topology/tfrecords/train_2ms/1493.tfrecords"
        string_val: "topology/tfrecords/train_2ms/1494.tfrecords"
        string_val: "topology/tfrecords/train_2ms/1495.tfrecords"
        string_val: "topology/tfrecords/train_2ms/1496.tfrecords"
        string_val: "topology/tfrecords/train_2ms/1497.tfrecords"
        string_val: "topology/tfrecords/train_2ms/1498.tfrecords"
        string_val: "topology/tfrecords/train_2ms/1499.tfrecords"
        string_val: "topology/tfrecords/train_2ms/149.tfrecords"
        string_val: "topology/tfrecords/train_2ms/1500.tfrecords"
        string_val: "topology/tfrecords/train_2ms/1501.tfrecords"
        string_val: "topology/tfrecords/train_2ms/1504.tfrecords"
        string_val: "topology/tfrecords/train_2ms/1505.tfrecords"
        string_val: "topology/tfrecords/train_2ms/1506.tfrecords"
        string_val: "topology/tfrecords/train_2ms/1507.tfrecords"
        string_val: "topology/tfrecords/train_2ms/1508.tfrecords"
        string_val: "topology/tfrecords/train_2ms/1509.tfrecords"
        string_val: "topology/tfrecords/train_2ms/150.tfrecords"
        string_val: "topology/tfrecords/train_2ms/1511.tfrecords"
        string_val: "topology/tfrecords/train_2ms/1512.tfrecords"
        string_val: "topology/tfrecords/train_2ms/1513.tfrecords"
        string_val: "topology/tfrecords/train_2ms/1514.tfrecords"
        string_val: "topology/tfrecords/train_2ms/1515.tfrecords"
        string_val: "topology/tfrecords/train_2ms/1518.tfrecords"
        string_val: "topology/tfrecords/train_2ms/1519.tfrecords"
        string_val: "topology/tfrecords/train_2ms/151.tfrecords"
        string_val: "topology/tfrecords/train_2ms/1520.tfrecords"
        string_val: "topology/tfrecords/train_2ms/1521.tfrecords"
        string_val: "topology/tfrecords/train_2ms/1523.tfrecords"
        string_val: "topology/tfrecords/train_2ms/1525.tfrecords"
        string_val: "topology/tfrecords/train_2ms/1526.tfrecords"
        string_val: "topology/tfrecords/train_2ms/1527.tfrecords"
        string_val: "topology/tfrecords/train_2ms/1528.tfrecords"
        string_val: "topology/tfrecords/train_2ms/1529.tfrecords"
        string_val: "topology/tfrecords/train_2ms/152.tfrecords"
        string_val: "topology/tfrecords/train_2ms/1530.tfrecords"
        string_val: "topology/tfrecords/train_2ms/1532.tfrecords"
        string_val: "topology/tfrecords/train_2ms/1533.tfrecords"
        string_val: "topology/tfrecords/train_2ms/1534.tfrecords"
        string_val: "topology/tfrecords/train_2ms/1535.tfrecords"
        string_val: "topology/tfrecords/train_2ms/1536.tfrecords"
        string_val: "topology/tfrecords/train_2ms/1538.tfrecords"
        string_val: "topology/tfrecords/train_2ms/153.tfrecords"
        string_val: "topology/tfrecords/train_2ms/1542.tfrecords"
        string_val: "topology/tfrecords/train_2ms/1544.tfrecords"
        string_val: "topology/tfrecords/train_2ms/1545.tfrecords"
        string_val: "topology/tfrecords/train_2ms/1546.tfrecords"
        string_val: "topology/tfrecords/train_2ms/1547.tfrecords"
        string_val: "topology/tfrecords/train_2ms/1548.tfrecords"
        string_val: "topology/tfrecords/train_2ms/1549.tfrecords"
        string_val: "topology/tfrecords/train_2ms/154.tfrecords"
        string_val: "topology/tfrecords/train_2ms/1551.tfrecords"
        string_val: "topology/tfrecords/train_2ms/1552.tfrecords"
        string_val: "topology/tfrecords/train_2ms/1553.tfrecords"
        string_val: "topology/tfrecords/train_2ms/1556.tfrecords"
        string_val: "topology/tfrecords/train_2ms/1557.tfrecords"
        string_val: "topology/tfrecords/train_2ms/1558.tfrecords"
        string_val: "topology/tfrecords/train_2ms/1559.tfrecords"
        string_val: "topology/tfrecords/train_2ms/155.tfrecords"
        string_val: "topology/tfrecords/train_2ms/1560.tfrecords"
        string_val: "topology/tfrecords/train_2ms/1561.tfrecords"
        string_val: "topology/tfrecords/train_2ms/1562.tfrecords"
        string_val: "topology/tfrecords/train_2ms/1564.tfrecords"
        string_val: "topology/tfrecords/train_2ms/1565.tfrecords"
        string_val: "topology/tfrecords/train_2ms/1566.tfrecords"
        string_val: "topology/tfrecords/train_2ms/1567.tfrecords"
        string_val: "topology/tfrecords/train_2ms/1568.tfrecords"
        string_val: "topology/tfrecords/train_2ms/1569.tfrecords"
        string_val: "topology/tfrecords/train_2ms/156.tfrecords"
        string_val: "topology/tfrecords/train_2ms/1570.tfrecords"
        string_val: "topology/tfrecords/train_2ms/1571.tfrecords"
        string_val: "topology/tfrecords/train_2ms/1573.tfrecords"
        string_val: "topology/tfrecords/train_2ms/1574.tfrecords"
        string_val: "topology/tfrecords/train_2ms/1576.tfrecords"
        string_val: "topology/tfrecords/train_2ms/1577.tfrecords"
        string_val: "topology/tfrecords/train_2ms/1578.tfrecords"
        string_val: "topology/tfrecords/train_2ms/157.tfrecords"
        string_val: "topology/tfrecords/train_2ms/1580.tfrecords"
        string_val: "topology/tfrecords/train_2ms/1581.tfrecords"
        string_val: "topology/tfrecords/train_2ms/1582.tfrecords"
        string_val: "topology/tfrecords/train_2ms/1583.tfrecords"
        string_val: "topology/tfrecords/train_2ms/1584.tfrecords"
        string_val: "topology/tfrecords/train_2ms/1585.tfrecords"
        string_val: "topology/tfrecords/train_2ms/1586.tfrecords"
        string_val: "topology/tfrecords/train_2ms/1587.tfrecords"
        string_val: "topology/tfrecords/train_2ms/1588.tfrecords"
        string_val: "topology/tfrecords/train_2ms/1589.tfrecords"
        string_val: "topology/tfrecords/train_2ms/158.tfrecords"
        string_val: "topology/tfrecords/train_2ms/1590.tfrecords"
        string_val: "topology/tfrecords/train_2ms/1593.tfrecords"
        string_val: "topology/tfrecords/train_2ms/1594.tfrecords"
        string_val: "topology/tfrecords/train_2ms/1595.tfrecords"
        string_val: "topology/tfrecords/train_2ms/1597.tfrecords"
        string_val: "topology/tfrecords/train_2ms/1598.tfrecords"
        string_val: "topology/tfrecords/train_2ms/1599.tfrecords"
        string_val: "topology/tfrecords/train_2ms/159.tfrecords"
        string_val: "topology/tfrecords/train_2ms/15.tfrecords"
        string_val: "topology/tfrecords/train_2ms/1600.tfrecords"
        string_val: "topology/tfrecords/train_2ms/1601.tfrecords"
        string_val: "topology/tfrecords/train_2ms/1602.tfrecords"
        string_val: "topology/tfrecords/train_2ms/1603.tfrecords"
        string_val: "topology/tfrecords/train_2ms/1604.tfrecords"
        string_val: "topology/tfrecords/train_2ms/1606.tfrecords"
        string_val: "topology/tfrecords/train_2ms/1607.tfrecords"
        string_val: "topology/tfrecords/train_2ms/1608.tfrecords"
        string_val: "topology/tfrecords/train_2ms/160.tfrecords"
        string_val: "topology/tfrecords/train_2ms/1611.tfrecords"
        string_val: "topology/tfrecords/train_2ms/1612.tfrecords"
        string_val: "topology/tfrecords/train_2ms/1613.tfrecords"
        string_val: "topology/tfrecords/train_2ms/1614.tfrecords"
        string_val: "topology/tfrecords/train_2ms/1615.tfrecords"
        string_val: "topology/tfrecords/train_2ms/1616.tfrecords"
        string_val: "topology/tfrecords/train_2ms/1618.tfrecords"
        string_val: "topology/tfrecords/train_2ms/1619.tfrecords"
        string_val: "topology/tfrecords/train_2ms/1620.tfrecords"
        string_val: "topology/tfrecords/train_2ms/1621.tfrecords"
        string_val: "topology/tfrecords/train_2ms/1622.tfrecords"
        string_val: "topology/tfrecords/train_2ms/1625.tfrecords"
        string_val: "topology/tfrecords/train_2ms/1626.tfrecords"
        string_val: "topology/tfrecords/train_2ms/1627.tfrecords"
        string_val: "topology/tfrecords/train_2ms/1628.tfrecords"
        string_val: "topology/tfrecords/train_2ms/1629.tfrecords"
        string_val: "topology/tfrecords/train_2ms/162.tfrecords"
        string_val: "topology/tfrecords/train_2ms/1630.tfrecords"
        string_val: "topology/tfrecords/train_2ms/1631.tfrecords"
        string_val: "topology/tfrecords/train_2ms/1633.tfrecords"
        string_val: "topology/tfrecords/train_2ms/1634.tfrecords"
        string_val: "topology/tfrecords/train_2ms/1635.tfrecords"
        string_val: "topology/tfrecords/train_2ms/1636.tfrecords"
        string_val: "topology/tfrecords/train_2ms/1637.tfrecords"
        string_val: "topology/tfrecords/train_2ms/1638.tfrecords"
        string_val: "topology/tfrecords/train_2ms/163.tfrecords"
        string_val: "topology/tfrecords/train_2ms/1640.tfrecords"
        string_val: "topology/tfrecords/train_2ms/1641.tfrecords"
        string_val: "topology/tfrecords/train_2ms/1642.tfrecords"
        string_val: "topology/tfrecords/train_2ms/1643.tfrecords"
        string_val: "topology/tfrecords/train_2ms/1644.tfrecords"
        string_val: "topology/tfrecords/train_2ms/1645.tfrecords"
        string_val: "topology/tfrecords/train_2ms/1646.tfrecords"
        string_val: "topology/tfrecords/train_2ms/1647.tfrecords"
        string_val: "topology/tfrecords/train_2ms/1648.tfrecords"
        string_val: "topology/tfrecords/train_2ms/1649.tfrecords"
        string_val: "topology/tfrecords/train_2ms/164.tfrecords"
        string_val: "topology/tfrecords/train_2ms/1650.tfrecords"
        string_val: "topology/tfrecords/train_2ms/1651.tfrecords"
        string_val: "topology/tfrecords/train_2ms/1652.tfrecords"
        string_val: "topology/tfrecords/train_2ms/1653.tfrecords"
        string_val: "topology/tfrecords/train_2ms/1654.tfrecords"
        string_val: "topology/tfrecords/train_2ms/1655.tfrecords"
        string_val: "topology/tfrecords/train_2ms/1656.tfrecords"
        string_val: "topology/tfrecords/train_2ms/1657.tfrecords"
        string_val: "topology/tfrecords/train_2ms/1658.tfrecords"
        string_val: "topology/tfrecords/train_2ms/1659.tfrecords"
        string_val: "topology/tfrecords/train_2ms/165.tfrecords"
        string_val: "topology/tfrecords/train_2ms/1660.tfrecords"
        string_val: "topology/tfrecords/train_2ms/1661.tfrecords"
        string_val: "topology/tfrecords/train_2ms/1662.tfrecords"
        string_val: "topology/tfrecords/train_2ms/1663.tfrecords"
        string_val: "topology/tfrecords/train_2ms/1664.tfrecords"
        string_val: "topology/tfrecords/train_2ms/1665.tfrecords"
        string_val: "topology/tfrecords/train_2ms/1666.tfrecords"
        string_val: "topology/tfrecords/train_2ms/1667.tfrecords"
        string_val: "topology/tfrecords/train_2ms/1668.tfrecords"
        string_val: "topology/tfrecords/train_2ms/166.tfrecords"
        string_val: "topology/tfrecords/train_2ms/1671.tfrecords"
        string_val: "topology/tfrecords/train_2ms/1672.tfrecords"
        string_val: "topology/tfrecords/train_2ms/1673.tfrecords"
        string_val: "topology/tfrecords/train_2ms/1674.tfrecords"
        string_val: "topology/tfrecords/train_2ms/1675.tfrecords"
        string_val: "topology/tfrecords/train_2ms/1676.tfrecords"
        string_val: "topology/tfrecords/train_2ms/1677.tfrecords"
        string_val: "topology/tfrecords/train_2ms/1678.tfrecords"
        string_val: "topology/tfrecords/train_2ms/167.tfrecords"
        string_val: "topology/tfrecords/train_2ms/1680.tfrecords"
        string_val: "topology/tfrecords/train_2ms/1681.tfrecords"
        string_val: "topology/tfrecords/train_2ms/1683.tfrecords"
        string_val: "topology/tfrecords/train_2ms/1685.tfrecords"
        string_val: "topology/tfrecords/train_2ms/1687.tfrecords"
        string_val: "topology/tfrecords/train_2ms/1688.tfrecords"
        string_val: "topology/tfrecords/train_2ms/1689.tfrecords"
        string_val: "topology/tfrecords/train_2ms/168.tfrecords"
        string_val: "topology/tfrecords/train_2ms/1691.tfrecords"
        string_val: "topology/tfrecords/train_2ms/1692.tfrecords"
        string_val: "topology/tfrecords/train_2ms/1694.tfrecords"
        string_val: "topology/tfrecords/train_2ms/1695.tfrecords"
        string_val: "topology/tfrecords/train_2ms/1696.tfrecords"
        string_val: "topology/tfrecords/train_2ms/1697.tfrecords"
        string_val: "topology/tfrecords/train_2ms/1699.tfrecords"
        string_val: "topology/tfrecords/train_2ms/169.tfrecords"
        string_val: "topology/tfrecords/train_2ms/16.tfrecords"
        string_val: "topology/tfrecords/train_2ms/1700.tfrecords"
        string_val: "topology/tfrecords/train_2ms/1702.tfrecords"
        string_val: "topology/tfrecords/train_2ms/1704.tfrecords"
        string_val: "topology/tfrecords/train_2ms/1706.tfrecords"
        string_val: "topology/tfrecords/train_2ms/1707.tfrecords"
        string_val: "topology/tfrecords/train_2ms/1708.tfrecords"
        string_val: "topology/tfrecords/train_2ms/170.tfrecords"
        string_val: "topology/tfrecords/train_2ms/1710.tfrecords"
        string_val: "topology/tfrecords/train_2ms/1711.tfrecords"
        string_val: "topology/tfrecords/train_2ms/1712.tfrecords"
        string_val: "topology/tfrecords/train_2ms/1714.tfrecords"
        string_val: "topology/tfrecords/train_2ms/1715.tfrecords"
        string_val: "topology/tfrecords/train_2ms/1716.tfrecords"
        string_val: "topology/tfrecords/train_2ms/1717.tfrecords"
        string_val: "topology/tfrecords/train_2ms/1718.tfrecords"
        string_val: "topology/tfrecords/train_2ms/1719.tfrecords"
        string_val: "topology/tfrecords/train_2ms/1720.tfrecords"
        string_val: "topology/tfrecords/train_2ms/1721.tfrecords"
        string_val: "topology/tfrecords/train_2ms/1722.tfrecords"
        string_val: "topology/tfrecords/train_2ms/1725.tfrecords"
        string_val: "topology/tfrecords/train_2ms/1726.tfrecords"
        string_val: "topology/tfrecords/train_2ms/1728.tfrecords"
        string_val: "topology/tfrecords/train_2ms/1729.tfrecords"
        string_val: "topology/tfrecords/train_2ms/172.tfrecords"
        string_val: "topology/tfrecords/train_2ms/1730.tfrecords"
        string_val: "topology/tfrecords/train_2ms/1731.tfrecords"
        string_val: "topology/tfrecords/train_2ms/1732.tfrecords"
        string_val: "topology/tfrecords/train_2ms/1733.tfrecords"
        string_val: "topology/tfrecords/train_2ms/1734.tfrecords"
        string_val: "topology/tfrecords/train_2ms/1735.tfrecords"
        string_val: "topology/tfrecords/train_2ms/1736.tfrecords"
        string_val: "topology/tfrecords/train_2ms/1737.tfrecords"
        string_val: "topology/tfrecords/train_2ms/1738.tfrecords"
        string_val: "topology/tfrecords/train_2ms/1739.tfrecords"
